[
    {
        "title": "Kadayawan festival",
        "islandGroup": "mindanao",
        "date": "3rd week of August",
        "dateFormat": "2022-08-14",
        "location": "Davao City",
        "paragraph1": "The Kadayawan Festival is a thanksgiving to nature for the harvest and life in general, held in the city of Davao in the Philippines. Kadayawan is a native expression in the Dabawnon tongue. It’s derived from the word “madayaw” which means good, valuable, and superior. Back in the day, the ethnic tribes of Davao would come together to celebrate abundant crops, performing rituals that paid tribute to the nature gods. They used to display fruits, vegetables, flowers, rice, and corn grains on their mats and at the front of their houses as a sign of respect for the great year they’ve had. They used to sing and dance as well, much like what they do today. In the 1970s, then Mayor Elias B. Lopez, encouraged the different Davao tribes to showcase their thanksgiving rituals. In 1986, the Davao City government launched a project that aimed to unite the people during the turbulent times of the Martial Law. Back then, the name of the festival was called Apo Duwaling, after three natural wonders you can find the region: Mt. Apo, Durian, and Waling-waling. It was first officially renamed as the Kadayawan Festival in 1988 by then Mayor Rodrigo Duterte, and now, over 30 years later, it’s still being celebrated.",
        "paragraph2": "It is once a small gathering, that now is one of the highly-anticipated festivals in the Philippines. From the dynamic street dancing to the vibrant giant floral parade, Kadayawan has something for everyone. It is Held every third week of August that Dabaweños celebrates as a thanksgiving event and a tribute to the lumad, a collective group of indigenous people living in the city. This is what makes Kadayawan a unique festival.",
        "img": "./img/fest-gallery/kadayawan-img1.jpg",
        "paragraph3": "The main highlight of the Kadayawan Festival is the parade with magnificent floral floats, street-dancing competitions and exhibits that showcase the island's original culture and history. If you visit Davao at this time, you will get a perfect chance to appreciate the wealth of Philippine culture, food, and traditions. Local people are open-hearted—they will be glad to share their joy with others.",
        "paragraph4": "",
        "imgItem1": "./img/fest-gallery/kadayawan-img2.jpg",
        "imgItem2": "./img/fest-gallery/kadayawan-img3.jpg",
        "imgItem3": "./img/fest-gallery/kadayawan-img4.jpg",
        "imgItem4": "./img/fest-gallery/kadayawan-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/96PmiOrSTsY",
        "ref": "https://guidetothephilippines.ph/articles/history-culture/kadayawan-festival-davao-guide",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkadayawan-img1.jpg?alt=media&token=31d4014d-f4ad-4e80-ab20-80940c121f05",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkadayawan-img2.jpg?alt=media&token=66dbd752-498d-4cad-b9b5-b4a36d501242",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkadayawan-img3.jpg?alt=media&token=4036a76b-1088-4c39-91ba-45b04b1ddb78",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkadayawan-img4.jpg?alt=media&token=4f3a21d6-216a-44ae-879f-f758ceeedced",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkadayawan-img5.jpg?alt=media&token=099fcdda-5d1c-4740-bbcf-f0d65c5fc908"
    },
    {
        "title": "Masskara Festival",
        "islandGroup": "visayas",
        "date": "October 1",
        "dateFormat": "2022-10-01",
        "location": "Bacolod",
        "paragraph1": "The MassKara Festival of Bacolod City is one the biggest festivals in the Philippines that is celebrated every October. During this Bacolod Festival, many travelers flock to the city to witness the electrifying celebration. MassKara is derived from the words “mass” meaning “many” and “kara” meaning “faces,” thus calling it the Festival of Many Faces. Masskara Festival was created to lift the spirits of the locals and bring back the smiles on their faces. The smiling masks were a declaration of the people of Bacolod City that they will pull through and survive the challenges and tragedies that they are facing.  Because of the smiling faces of the mask, Bacolod City got the nickname of The City of Smiles. Believe it or not, the festival has been giving local and international visitors the chance to have fun, drink, and party on the streets of Bacolod for over 30 years now",
        "paragraph2": "Rodney Martinez, of the Arts Association of Bacolod-Negros, held workshops in Negros in 1979, teaching villagers how to build masks out of coconut husks and paper mâché. Originally, these masks were made solely for the purpose of selling them to tourists and earning money, rather than for a celebration that they had yet to imagine. Local people supposedly made colorful masks as a signature remembrance of the province and to attract foreign visitors' attention. Fortunately, the concept was a hit, and travelers began purchasing the masks because they were light and portable. They can also be worn while seeing the tourist attractions in Bacolod.",
        "img": "./img/fest-gallery/masskara-img1.jpg",
        "paragraph3": "Expect a warm greeting from Bacolod residents, since the city is known as The City of Smiles. Festivals in the Philippines tend to bring out the friendliest side of everyone, so don't be afraid about making friends with the locals. They might even give you the best travel advice! The festival's music, like the festival itself, has had a colorful evolution. The festival has moved away from folk melodies and now uses a mix of Latin beat remixes and Philippine jazz to enliven the street dances.",
        "paragraph4": "The event continues to represent a time of year when people can 'throw away' their unhappiness or any pain they are facing, just as they did when it first began all those years ago. This is a new beginning or a new start for them. It is hailed as a breathtaking sight to witness and something that everyone should strive to witness at least once in their lives. It is also described as the world's longest festival, lasting a month and featuring many festivities, parties, and gatherings in commemoration of the topic.",
        "imgItem1": "./img/fest-gallery/masskara-img2.jpg",
        "imgItem2": "./img/fest-gallery/masskara-img3.jpg",
        "imgItem3": "./img/fest-gallery/masskara-img4.jpg",
        "imgItem4": "./img/fest-gallery/masskara-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/GmQfC5MDjXk",
        "ref": "https://sarahfunky.com/travel/2019/10/23/the-history-of-the-masskara-festival-in-bacolod/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmasskara-img1.jpg?alt=media&token=1d6bc3ad-ac7c-484e-aed1-b053b84bc7d2",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmasskara-img2.jpg?alt=media&token=524792f3-b892-4c51-b4f6-8c6ddd962bf1",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmasskara-img3.jpg?alt=media&token=6b8191db-1a89-449a-bf6f-aad361157ebe",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmasskara-img4.jpg?alt=media&token=946110e4-f1bb-42df-b4d0-2770442e584d",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmasskara-img5.jpg?alt=media&token=e3824fca-5692-43a8-a579-a9545eee46a2"
    },
    {
        "title": "Tuna Festival",
        "islandGroup": "mindanao",
        "date": "September 1",
        "dateFormat": "2022-09-01",
        "location": "General Santos City",
        "paragraph1": "General Santos City's Tuna Festival is a must-see attraction. Because of the quantity of tuna fish, the city is also known as the Philippines Tuna Capital. Yellowfin tuna fish abound in the waterways surrounding the city, making it one of the top tuna producers in the world. Furthermore, General Santos is regarded as a world-class tuna supply. It's no surprise that the residents painstakingly organized the Tuna Festival.  The General Santos City Tourism Association – a consortium of hotels, resorts, restaurants, travel agencies, and other tourism-related establishments, then chaired by Mrs. Liwanag Ferrer – staged an event at the Halieus Mall (now RD Plaza) in 1998 to celebrate the city's 30th city charter anniversary, which featured tuna cuisine through culinary competitions, exhibits, and other activities dubbed a Tuna Festival.",
        "paragraph2": "Since 1998, General Santos City has hosted an annual tuna festival. The vibrant event takes place in the first week of September every year, and it's when all things tuna is celebrated. For the country's largest producer of sashimi-grade tuna, this makes perfect sense. Unlike other fruit festivals like the Lanzones Festival and the Mango Festival, this is a celebration of all things tuna and the place to be if you want to eat tuna. The fact that this remembrance is a celebration of all things tuna sets it apart from all other celebrations in the country. It is certainly praiseworthy to visit during this event, with all of the lovely activities highlighting tuna as the key topic.",
        "img": "./img/fest-gallery/tuna-img1.jpg",
        "paragraph3": "During the Tuna Festival, locals showcase the province’s bountiful catch with colorful, ocean-themed floats. Another activity that everyone’s looking forward to is the Sugbahan sa Dalan where a long line of grills is set up on the street and hundreds of kilos of tuna are grilled on the spot. And the best thing about this festival in the Philippines is, everything’s free. The scents of the fish can be a bit overwhelming, but the good news is that you’ll get used to them pretty fast. And if you actually like seafood and enjoy the scents, then there are no issues at all",
        "paragraph4": "Participating in the Tuna Festival would undoubtedly remind you of the Philippines' sea's abundant diversity and richness. It's also a great opportunity to mingle and learn more about the culture of the local fisherman as they go about their everyday lives along the coast. It is essential to enjoy and relax as this festivity will bring out the inner sea spirit of you.",
        "imgItem1": "./img/fest-gallery/tuna-img2.jpg",
        "imgItem2": "./img/fest-gallery/tuna-img3.JPG",
        "imgItem3": "./img/fest-gallery/tuna-img4.jpg",
        "imgItem4": "./img/fest-gallery/tuna-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/TSpDxD74DuQ",
        "ref": "https://expertworldtravel.com/philippines/tuna-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftuna-img1.jpg?alt=media&token=7ffc53fc-a008-406c-b965-9252b1456e45",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftuna-img2.jpg?alt=media&token=dc1e1001-26e5-4c7c-9310-fd6bee1ab72f",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftuna-img3.JPG?alt=media&token=8627d3a5-9e5d-444b-8a11-bb8bbde23716",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftuna-img4.jpg?alt=media&token=e488d814-2473-447f-8ab3-80ab7d922a03",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftuna-img5.jpg?alt=media&token=da0041ae-bfff-4908-a8e5-0f7bb21fe0d7"
    },
    {
        "title": "Higantes Festival",
        "islandGroup": "luzon",
        "date": "November 23",
        "dateFormat": "2022-11-23",
        "location": "Angono, Rizal",
        "paragraph1": "Higantes Festival is one of the Philippines’ most awaited events because of how unique the locals of Angono celebrate this festival. During this time, higantes or giants made of papier-mâché parade the whole town. These giants vary in sizes and are dressed in colorful Higantes Festival costumes so beautifully that they always take the media and tourists’ attention. It is held every November 23 in the town of Angono in Rizal province known as the “Art Capital of the Philippines.” The Municipality of Angono likewise considers the ‘higante’ as the symbol of the people’s aspiration to be great in their respective field and contribute to the development and pride of this town which is home to two National Artists namely ‘Botong’ Francisco (Painting) and Maestro Lucio San Pedro (Music).",
        "paragraph2": "The Higantes, or papier-mâché giants, were created by locals as a sign of protest during Spanish colonization, as per Angono tradition. According to a study conducted by James Owen Saguinsin, a professor at Far Eastern University, the giants do not exist, and what the residents refer to as the higantes is a tall hacienda caretaker named Karias Tangkad, whom the inhabitants exacted vengeance on. Saguinsin also believes that the gigantic papier-mache first began after World War II, when National Artist Carlos 'Botong' Francisco commissioned Artemio Tajan, the first higante maker, to give a festive and joyful element to Angono's post-war fiesta celebration. The Higantes Festival Tagalog has evolved throughout the years with magnificent works of art, as evidenced by the stylish higantes sets each year, the colorful Higantes Festival costume, the activities, and more.",
        "img": "./img/fest-gallery/higantes-img1.JPG",
        "paragraph3": "Higantes currently reflect the various barangays or smallest unit societies of Angono, such as the duck-shaped higante of a particular barangay, which is known for its one and only fried duck and 'balut.'  Mr. Perdigon Vocalan added to the excitement of the celebration by portraying the 13 barangays of Angono with two to four higantes that represented their personalities as well as the history of their barangay.",
        "paragraph4": "The primary procession of this celebration features Higantes and a musical ensemble. Parehadores are young girls dressed in brightly colored outfits. As a symbol of San Clemente, they are holding a sagwan, or wooden boat. Many people are also wearing and carrying fishing nets and other fishing-related items. Several parade teams compete against one another for the finest procession throughout the festival.",
        "imgItem1": "./img/fest-gallery/higantes-img2.jfif",
        "imgItem2": "./img/fest-gallery/higantes-img3.jpg",
        "imgItem3": "./img/fest-gallery/higantes-img4.jpg",
        "imgItem4": "./img/fest-gallery/higantes-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/SLHnteboJhA",
        "ref": "https://www.zenrooms.com/blog/post/higantes-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhigantes-img1.JPG?alt=media&token=92704778-b174-4cf3-bcd5-8af67f24c291",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhigantes-img2.jfif?alt=media&token=595878d7-3a4d-428a-a614-cd0807754b3f",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhigantes-img3.jpg?alt=media&token=e154780b-4323-416b-a114-23824ffc8663",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhigantes-img4.jpg?alt=media&token=69012bb6-b105-4a0e-af91-4099c8809d42",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhigantes-img5.jpg?alt=media&token=81993792-56ba-425a-898b-ab2293974657"
    },
    {
        "title": "Mango Festival",
        "islandGroup": "luzon",
        "date": "April 1",
        "dateFormat": "2022-04-01",
        "location": "Zambales",
        "paragraph1": "Mango Festival is home to some of the sweetest, juiciest most succulent mangos you will ever see in the Philippines. The festival is held in Iba, Zambales. The event is a celebration of a bountiful harvest of mangoes and other agricultural products which the province is so known for. It is aimed to highlight the must-see attractions and places of interest in all its towns. Mangoes cultivated in Zambales particularly the Dinamulag variety of Carabao mangoes were cited as the world's sweetest mangoes by Guinness World Records in 1995 and the country's sweetest mangoes by the Department of Agriculture in 2013. In 2015, other events unrelated to the province's mangoes such as sports events were introduced while the province's fruit remain the centerpiece of the festival. The festival was first held in 1999.",
        "paragraph2": "This festival brings together locals and foreigners alike to savor and promote the island’s best mangoes. Since a large part of the city’s economy relies on the export of mangoes, it’s no surprise that there’s an entire festival dedicated to the fruit.",
        "img": "./img/fest-gallery/mango-img1.jpg",
        "paragraph3": "The mango eating challenge is one of the highlights of the Mango Festival, where contestants compete to see who can eat the most mangos in a set amount of time. And, of course, no Filipino celebration would be complete without a street parade featuring locals dressed in bright, mango-inspired costumes! Hundreds of them crowd the streets, swaying to the beat of the music in various costumes, exuding a genuine excitement. The Trade Fair, the Variety Show, and the mango-themed street parades are some of the other popular events to look forward to. There's also a street dancing competition, which is a must-see at almost any festival in the country. There's also a spectacular float procession, much like at all other Filipino festivities, with floats inspired by the luscious fruit.",
        "paragraph4": "The Mango Festival or also known as Dinamulag Festival lasts for at least 4-5 days, and there is a plethora of different events to enjoy. On its last day is marked by a coronation ceremony, where the winners of all the previous competitions in the mango festival are announced. After that, the festival is closed off with a spectacular fireworks display. The Mango Festival is a fantastic opportunity to experience some of the Philippines' tastiest mangoes. Simply make it a point to include the Mango Festival in your vacation itinerary if you happen to be in Zambales in April.",
        "imgItem1": "./img/fest-gallery/mango-img2.jpg",
        "imgItem2": "./img/fest-gallery/mango-img3.jpg",
        "imgItem3": "./img/fest-gallery/mango-img4.jpg",
        "imgItem4": "./img/fest-gallery/mango-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/WmFdZBzsRzE",
        "ref": "https://expertworldtravel.com/philippines/mango-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmango-img1.jpg?alt=media&token=deb1ca56-6598-4eb7-8ff2-c0bff09473ab",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmango-img2.jpg?alt=media&token=d3083b99-4faf-4eff-b135-53c51217aed9",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmango-img3.jpg?alt=media&token=a299e673-676f-4871-a4cb-28cc977d6a5e",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmango-img4.jpg?alt=media&token=be700105-0efe-4611-9710-16ae62e9b1aa",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmango-img5.jpg?alt=media&token=0bc5688c-52e8-4969-a670-b07683259d01"
    },
    {
        "title": "Bangus Festival",
        "islandGroup": "luzon",
        "date": "April 3",
        "dateFormat": "2022-04-03",
        "location": "Dagupan City",
        "paragraph1": "Bangus Festival is held in Dagupan City, Pangasinan, to appreciate the city's growing aquaculture, particularly the abundant bangus or milkfish harvests. The Dagupan Bangus festival is recognized as one of the three best festivals celebrated in the Philippines. The prestigious recognition is given by the Association of Tourism Officers of the Philippines and also by the Department of Tourism. Dagupan City in Pangasinan is also known as the Bangus Capital of the Philippines. There is no exact Bangus Festival date but it is a 10-day event held every April. Among the highlights of this non-religious festival are the bangus cook-off, street party, trade fairs and of course, the electrifying festival dance in the streets.",
        "paragraph2": "The Bangus Festival is the brainchild of former Dagupan mayor Benjamin Lim, seeking to promote the city as the Bangus (milkfish) Capital of the World. The festival made the Guinness Book of World Records in 2003 when it set the record for the World's Longest Barbeque which measured slightly over 1 kilometer and broke the long-standing world record by Peru in November of 1999 at 613 meters. A laser guided equipment was used to accurately measure the longest bangus barbecue. It was later taken by the town of Bayambang, Pangasinan in 2014.",
        "img": "./img/fest-gallery/bangus-img1.jpg",
        "paragraph3": "Dagupan is a city located on the Lingayen gulf in the province of Pangasinan in Luzon and is one of the top producers of milkfish or bangus in the province. Bangus is considered the tastiest milkfish in the world. Because it is a big event, many media entities not just from the Philippines but across the world are covering this annual event in Dagupan.",
        "paragraph4": "The Bangus festival is merely a symbol of their culture. Furthermore, the festival features their indigenous goods, making it an ideal opportunity to experience Philippine culture firsthand. Furthermore, there are commercial and tourism fairs, which adds to the excitement. The culinary and garden fairs add to the overall appeal of the event. Trade and tourism expos have helped the Bangus festival garner followers from all over the world. People from across the globe have started appreciating the festival and anticipate the same each year.",
        "imgItem1": "./img/fest-gallery/bangus-img2.jpg",
        "imgItem2": "./img/fest-gallery/bangus-img3.jpg",
        "imgItem3": "./img/fest-gallery/bangus-img4.jpg",
        "imgItem4": "./img/fest-gallery/bangus-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/fddDQu-rkeA",
        "ref": "https://www.philippinetraveldestinations.com/dagupan-bangus-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbangus-img1.jpg?alt=media&token=33d6b18d-f15d-4ff6-a378-eaba2a1940bf",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbangus-img2.jpg?alt=media&token=ac1edff4-d763-4c5f-a011-1f4f10e94b6b",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbangus-img3.jpg?alt=media&token=d2edaf50-1c26-427c-9a6a-e65dae5d966d",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbangus-img4.jpg?alt=media&token=4361764a-aa48-4c93-9de1-b043f4c5e71f",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbangus-img5.jpg?alt=media&token=d27b0715-d46d-401c-abde-25fc326b5ad1"
    },
    {
        "title": "Moriones Festival",
        "islandGroup": "luzon",
        "date": "March 14 ",
        "dateFormat": "2022-03-14",
        "location": "Marinduque",
        "paragraph1": "It is one of the Philippines' oldest religious celebrations. The Moriones Festival honors Longinus, a half-blind Roman soldier who used a lance to puncture Jesus' side when he was on the cross. According to legend, when some of Jesus' blood went into his eyes, he regained his sight. Longinus became convinced that Jesus was indeed the son of God after witnessing this miracle and converted to Christianity. The event recreates the centurions' search for Longinus for this crime, with one member of the local community portraying Longinus, who is captured and recaptured multiple times throughout the festival in a lighthearted game of cat and mouse. This is a traditional activity held every Holy Week in the island province of Marinduque in the Philippines. But unlike other festivals in the Philippines, Moriones is, according to religious sectors, not a festive occasion.",
        "paragraph2": "The place of origin of Moriones Festival is in Mogpog. It first appeared in 1807 as initiated by the Parish Priest of the town. Moriones is derived from the word “Morion” which means mask or visor hence, the mask in the Moriones Festival costume. It is a part of the medieval Roman armor which covers the face. Moriones, on the other hand, refers to the masked and costumed men and women penitents who march around the town for seven days re-enacting the search for Longinus.",
        "img": "./img/fest-gallery/moriones-img1.jpg",
        "paragraph3": "Every time this festival is held, Morions roam the streets in seven days, from Holy Monday to Easter Sunday. Not only this is held in the town of Mogpog but it is also done in the towns of Boac, Gasan, Santa Cruz, and Buenavista in Marinduque. Aside from the parade, there’s also a Moriones Festival dance and some short acts re-enacting what happened during the time of Longinus. Various towns also hold pabasa or the recitation of Christ’s passion in verse.",
        "paragraph4": "The highlight of this solemn tradition is the “pugutan,” a re-enactment of the beheading of Longinus on Easter Sunday. Over the years, Moriones Festival has gained attention from across the world, even international media are covering this. The festival draws about tens of thousands tourists to the island, according to Marinduque tourism officer Dindo Asuncion.",
        "imgItem1": "./img/fest-gallery/moriones-img2.jpg",
        "imgItem2": "./img/fest-gallery/moriones-img3.jpg",
        "imgItem3": "./img/fest-gallery/moriones-img4.jpg",
        "imgItem4": "./img/fest-gallery/moriones-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/qsjgD-mlBBI",
        "ref": "https://www.zenrooms.com/blog/post/moriones-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmoriones-img1.jpg?alt=media&token=496bafa0-c4b2-4b62-a1ba-5f2ade368746",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmoriones-img2.jpg?alt=media&token=9df6e659-d8e4-4563-aa6e-bba47d8189c6",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmoriones-img3.jpg?alt=media&token=3d63d228-b8e9-44b8-b914-d30109348b0c",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmoriones-img4.jpg?alt=media&token=3b17c5e9-a141-4682-ab71-ea9aeea6dc36",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmoriones-img5.jpg?alt=media&token=1559eb3f-cb6c-4992-bd71-410da02aa296"
    },
    {
        "title": "Sinulog Festival",
        "islandGroup": "visayas",
        "date": "January 16",
        "dateFormat": "2022-01-16",
        "location": "Cebu City",
        "paragraph1": "Sinulog Festival or Santo Nino Festival is an annual religious and cultural festival in Cebu. The festival is thought to be the first of the most well-known festivals in the Philippines. People from all around the world came to see the events, not just Filipinos. The festival's beauty has earned it the name Mother of All Festivals among Filipinos and other Asians. The Sinulog Festival never ceases to impress its audience, from the dancers' colorful and well-made costumes to the stunning dances and music provided by the drums, trumpets, and native gongs. With the celebration’s evolution, the Sinulog Festival has become a month long tradition in Cebu. Sinulog comes from the Cebuano word “sulog” which means “like water current movement” which depicts the forward-backward step of Sinulog dance.",
        "paragraph2": "The Santo Niño de Cebú, one of the country's most notable historic treasures, is honored at Sinulog. The Portuguese navigator Ferdinand Magellan presented this statue of the baby Jesus to the Rajah Humabon of Cebu in 1521. This was one of the most significant events in Philippine religious history since it cleared the way for the country's conversion to Christianity. At the moment of receiving the holy image, it was said that Queen Juana, the main consort of Rajah Humabon, danced with joy holding this image of the child Jesus.The other natives followed her example, and this event was regarded as the first Sinulog dance. The same event was used as the basis for most Sinulog dances.",
        "img": "./img/fest-gallery/sinulog-img1.jpg",
        "paragraph3": "Tourists would never want to miss the opportunity to watch the festival as it grew in popularity year after year, and it became increasingly commercialized. The festival now includes events such as art exhibits, beauty pageants, picture contests, and singing and dancing contests, in addition to costumes and dances. Besides the religious part of the celebration, Sinulog is also well-known for its street parties before the day of celebration and during the day of the festival.",
        "paragraph4": "With the overwhelming amount of people who wish to witness the traditional celebration and the beauty of the culture it depicts, this grand festival remains as Cebu’s proudest attraction, along with the beautiful beaches and historical places. Aside from the Sinulog Festival, Cebu has a lot of tourist attractions and activities in store for you. Sinulog is one of the most-awaited events in the Philippines so expect to see a lot of people in the streets who will participate in the celebration.",
        "imgItem1": "./img/fest-gallery/sinulog-img2.jpg",
        "imgItem2": "./img/fest-gallery/sinulog-img3.jpg",
        "imgItem3": "./img/fest-gallery/sinulog-img4.jpg",
        "imgItem4": "./img/fest-gallery/sinulog-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/ZCkNMYuszz0",
        "ref": "https://guidetothephilippines.ph/articles/history-culture/sinulog-festival-cebu-guide",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsinulog-img1.jpg?alt=media&token=587cba38-e995-4b22-ac75-37f8c30a1cf4",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsinulog-img2.jpg?alt=media&token=f9053aaa-2d9f-4660-b2b4-4ee3bbd8ed9e",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsinulog-img3.jpg?alt=media&token=22249796-c97f-45cf-9f9b-3d59fa52c259",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsinulog-img4.jpg?alt=media&token=a1cf2366-5309-4694-9955-53ff222682a4",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsinulog-img5.jpg?alt=media&token=9161c6d1-3524-4665-b809-c93a3dbce0fc"
    },
    {
        "title": "Ati-Atihan Festival",
        "islandGroup": "visayas",
        "date": "January 15",
        "dateFormat": "2022-01-15",
        "location": "Kalibo, Aklan",
        "paragraph1": "The Ati-Atihan festival is a Philippine festival held annually in January in honor of the Santo Niño in several towns of the province of Aklan, Panay Island. The biggest celebration is held during the third Sunday of January in the town of Kalibo, the province’s capital. The name Ati-Atihan means to imitate Ati, the local name of the Aeta people, the first settlers of Panay Island and other parts of the archipelago. The festivity was originally a pagan celebration to commemorate the Barter of Panay, where the Aeta accepted gifts from Bornean chieftains called Datu, who fled with their families to escape a tyrannical ruler, in exchange for being allowed to dwell in the Aeta’s lands. They celebrated with dancing and music, with the Borneans having painted their bodies with soot to show their gratefulness and camaraderie with the Aeta who had dark skin. Later on, the festivity was given a different meaning by the church by celebrating the acceptance of Christianity, as symbolized by carrying an image of the Holy Child or Infant Jesus during the procession.",
        "paragraph2": "It is the ultimate jubilating, titillating, stimulating, riotous and frenetic aboriginal street dancing to the early primitive tempo and pulse of drums, participated in by different tribes in their full battle regalia as they crowd the principal streets of Kalibo rejoicing breathlessly to their religious vows.  The start of the procession is signaled by drums and whistles, and later punctuated by shouts of “Hala Bira!”",
        "img": "./img/fest-gallery/ati-atihan-img1.jpg",
        "paragraph3": "Dubbed as the Mother of All Philippine Festivals, the Ati-Atihan Festival is widely known not just in the Philippines but across the world. The Ati-Atihan Festival celebration consists of multiple events that happen in various parts of Kalibo town. You’ll never run out of things to do because Ati-Atihan has all kinds of events—from solemn masses, loud marching bands to partying on the streets.",
        "paragraph4": "The Ati-Atihan also bears a deep religious significance. The pahilot, a faith-healing tradition, is held during the festival where a Catholic priest rubs the devotee’s body with the image of the Santo Niño, with the belief that it heals both the body and soul. Many of the townsfolk believe in this ritual and there have been reports of barren women who have been able to conceive after the pahilot. Just like any other festival, Ati-Atihan will be so much fun and will help us interact with many people and learn different cultures in Kalibo, Aklan.",
        "imgItem1": "./img/fest-gallery/ati-atihan-img2.jpg",
        "imgItem2": "./img/fest-gallery/ati-atihan-img3.jpg",
        "imgItem3": "./img/fest-gallery/ati-atihan-img4.jpg",
        "imgItem4": "./img/fest-gallery/ati-atihan-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/0GddP5BdwFE",
        "ref": "https://artsandculture.google.com/entity/ati-atihan-festival/m04dvsl?hl=en",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fati-atihan-img1.jpg?alt=media&token=f55bf4ba-04bf-40b5-a6e5-22eb5fede652",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fati-atihan-img2.jpg?alt=media&token=835064fa-9caa-412e-a508-beab2dd15979",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fati-atihan-img3.jpg?alt=media&token=caf9c3ce-1be0-48ee-b5f3-d946f80af9aa",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fati-atihan-img4.jpg?alt=media&token=1bf3e31b-ceb3-4fc3-8bda-a93b66db7a09",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fati-atihan-img5.jpg?alt=media&token=c7f53f13-38e0-4f5f-ae2b-c6dfd180a13e"
    },
    {
        "title": "Dinagyang Festival",
        "islandGroup": "visayas",
        "date": "January 24",
        "dateFormat": "2022-01-24",
        "location": "Ilo-Ilo City",
        "paragraph1": "Dinagyang Festival is one of the Philippines' largest and most prestigious events. It explores the history of Filipino devotees' devotion to the Holy Child Jesus, also known as Sr. Sto. Nino. Dinagyang is a Hiligaynon word that means “merrymaking.” Just like the Sinulog and Ati-Atihan Festivals, Dinagyang Festival is one of the religious festivities in the Philippines that celebrates the feast of the Santo Niño and the pact between the Datus and locals. The celebration also recalls the advent of the Malay settlers and the history of Panay Island's fabled barter with the indigenous known as Ati. Dinagyang season in Iloilo City is on the first month of the year and highlighted with an Ati Tribe Competition every fourth Sunday of January. The players perform spectacular choreography in colorful tribal costumes and eye-catching decorations to portray socio-cultural and religious scenes from Panay prior to Spanish colonization and the introduction of Catholicism to the country.",
        "paragraph2": "The Dinagyang celebration began in 1967, when an Augustinian priest from Cebu gave a replica picture of the Santo Nino to a fellow Augustinian priest in Iloilo as a birthday present. Every Friday since then, a novena liturgy has been held at the San Jose Parish Church. In 1969, a tournament comparable to the popular Ati-Atihan Festival in Kalibo, Aklan province, was held. At the time, the Dinagyang was known as Iloilo Ati-Atihan, but when radio station Pacifico Sudario insisted on adopting a local word to separate the event from the well-known Ati-Atihan of Kalibo, Dinagyang became the official name almost a decade later.",
        "img": "./img/fest-gallery/dinagyang-img1.jpg",
        "paragraph3": "The celebration of Santo Nino is marked with flamboyant costumes and traditional dances. The fun in this, especially for visitors, lies in getting acquainted with the local culture as well as getting a glimpse into the daily happenings in the country. Dinagyang is one of the most-awaited festivals in the Philippines because of its fun, lively, and colorful celebration. The festival’s major events include the fluvial procession, religious sadsad, and the Ati tribes’ dance competition. In addition, there are many exciting activities happening all throughout the month of January.",
        "paragraph4": "Vibrant colors and thundering drum rhythms are to be expected. Enjoy a spectacular performance mastered over months of preparation and physical exertion. Expect the crowd to yell hala bira, the dancers' battle cry to encourage them to keep dancing their best. If you don't mind standing, this incredible talent show is free. The parade path snakes through Iloilo City Proper, and you can see the performances from any place along it.",
        "imgItem1": "./img/fest-gallery/dinagyang-img2.jpg",
        "imgItem2": "./img/fest-gallery/dinagyang-img3.jpg",
        "imgItem3": "./img/fest-gallery/dinagyang-img4.jpg",
        "imgItem4": "./img/fest-gallery/dinagyang-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/yzSXsMUh2tU",
        "ref": "https://philippines.travel/events/dinagyang-festival",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fdinagyang-img1.jpg?alt=media&token=10b29106-6edf-4f12-b3b5-ef25106924b5",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fdinagyang-img2.jpg?alt=media&token=70b9769d-106b-4be3-8a4a-c250143b9193",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fdinagyang-img3.jpg?alt=media&token=20b4e391-6054-47e1-b507-6ced3ede4714",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fdinagyang-img4.jpg?alt=media&token=9d0f6aeb-f295-48e8-a453-f8982260f231",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fdinagyang-img5.jpg?alt=media&token=24c70f6e-3756-4185-a627-e97cdcdbb64a"
    },
    {
        "title": "Pahiyas Festival",
        "islandGroup": "luzon",
        "date": "May 15",
        "dateFormat": "2022-05-15",
        "location": "Lucban, Quezon",
        "paragraph1": "Every famous holiday in the Philippines is typically colorful, and the Pahiyas Festival is without a doubt one of the Philippines' brightest and brilliant festivals. Pahiyas, like most Philippine celebrations, is held to express gratitude for the abundant harvest. The town of Lucban, celebrates one of the country’s biggest, and most colorful harvest festivals every May 15, along with the towns of Tayabas, Sariaya, Gumaca, Tiaong, and Lucena City, the festivities are the Philippines best known harvest festivals to honor San Isidro Labrador, the patron of farmers. Residents of the town center adorn the facade of their homes with fresh harvest of fruits and vegetables such as squash, bittergourd, bananas and tomatoes. They also make pretty and colorful lanterns out of kiping, which is a leaf-shaped wafer laboriously made from rice dough.",
        "paragraph2": "The word pahiyas comes from “payas” which means to decorate or decorate. The Pahiyas Festival meaning can easily be noticed once you see the beautiful house decorations in Lucban, Quezon. The origins of the Pahiyas Festival can be traced all the way back to the 16th century. It wasn't like the festival we know now back then. Farmers would carry their harvests at the base of Mt. Banahaw and sell their wares. They gathered and celebrated humble feasts to thank the Anitos for their abundant harvests. Farmers, on the other hand, simply brought their produce to be blessed by the priest when the first church was completed. The following year, they had another rich crop as a result of their actions. As a result, they established a custom of bringing their harvests to the church for the Lord's blessings. However, the chapel eventually became too small to house the overflowing supplies.",
        "img": "./img/fest-gallery/pahiyas-img1.jpg",
        "paragraph3": "The Lucban Festival evolved into the colorful harvest festival we know today, with people dressed in amazing Pahiyas Festival costumes marching through the streets and performing a Pahiyas Festival dance. Cultural shows, trade fairs, art exhibits, and numerous contests are all part of the Pahiyas Festival month celebration to help the tourism economy. That is exactly what happened. Locals from surrounding provinces, as well as visitors from other countries, are flocking to Lucban to see and photograph the Pahiyas Festival.",
        "paragraph4": "Locals believe that keeping the tradition alive was essential because it brought them away from deprivation and misfortune in their town. There are a handful of major town festival and bright festivals observed around the Philippines, thanks to the Filipinos' fun-loving enthusiasm and creativity. There are many activities that the residents and even visitors will both enjoy while also learning different cultures and interacting with different people.",
        "imgItem1": "./img/fest-gallery/pahiyas-img2.jpg",
        "imgItem2": "./img/fest-gallery/pahiyas-img3.jpg",
        "imgItem3": "./img/fest-gallery/pahiyas-img4.jpg",
        "imgItem4": "./img/fest-gallery/pahiyas-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/fWX2Eo5scsc",
        "ref": "https://www.zenrooms.com/blog/post/pahiyas-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpahiyas-img1.jpg?alt=media&token=15b1c68a-2943-48e9-8cd0-db57b19ebb64",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpahiyas-img2.jpg?alt=media&token=493d6beb-5e3d-4de0-ac0f-2dc9232c7920",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpahiyas-img3.jpg?alt=media&token=b421bef9-3c3a-4a64-8394-e27015367e30",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpahiyas-img4.jpg?alt=media&token=5c06459a-57e4-4ed9-bb70-5b2cb9bb4163",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpahiyas-img5.jpg?alt=media&token=af94786c-c589-4b9f-aa51-fa1944677908"
    },
    {
        "title": "Panagbenga Festival",
        "islandGroup": "luzon",
        "date": "February 1",
        "dateFormat": "2022-02-01",
        "location": "Baguio City",
        "paragraph1": "The highlands of Baguio City in the Philippines has been known as the country’s Summer Capital. That’s why people make the long road trip to Baguio from Manila to escape the stifling heat of the lowlands and polluted cities in the metro. Another reason tourist travel to the City of Pines is the Baguio Flower Festival or Panagbenga Festival. Panagbenga is an annual flower festival in Baguio City, Philippines, that takes place every February. The word Panagbenga stems from a Kankanaey word that means blooming season. The history, customs, and ideals of Baguio and the Cordilleras are reflected in this celebration. It lasts for over a month and thrives thanks to the participation of the community. Since this is a month-long festival, there are a plethora of activities to enjoy and take part in, from the landscaping competition to the golf tournament. As is tradition with most Filipino festivals, a Grand Parade marks the beginning of Panagbenga Festival.",
        "paragraph2": "The Baguio Flower Festival began when lawyer Damaso E. Bangaoet, Jr., John Hay Poro Point Development Corporation (JPDC) Managing Director for Camp John Hay, offered the idea of organizing a flower festival in Baguio to the JPDC Board of Directors. The Board, chaired by Chairman Victor A. Lim of the Bases Conversion Development Authority (BCDA) and JPDC President Rogelio L. Singson of the JPDC, quickly approved the proposal. It was also determined that the Festival would take place in February each year. In October 1995, the Baguio Festival got its official logo from entries to the Annual Camp John Hay Art Contest. Professor Macario Fronda of Saint Louis University wrote a Festival Hymn after that. The rhythm and motions of the Bendian Dance, an Ibaloi celebratory dance, were also incorporated into the song. The circular movements of the Bendian dance represent the tribe's oneness and peace.",
        "img": "./img/fest-gallery/panagbenga-img1.jpg",
        "paragraph3": "New activities and initiatives have been introduced as the Panagbenga Festival progresses. Tourists are enthralled by Baguio's offerings. The Cordillerans' inventiveness, togetherness, culture, and customs were praised. Cordillerans demonstrate their ingenuity by creating massive flower floats. During the Grand Float Parade, they will be paraded through the streets of Baguio. Along with this, the residents, primarily students, conduct a vibrant, colorful, and cultural street dance. The celebration arose from the desire of the people to create their own festival, one that was particularly Baguio.",
        "paragraph4": "Because this flower festival is one of the most anticipated festivals in the Philippines, expect the Panagbenga Festival to be crowded, and full of many fun and exciting events. Moreover, during the Baguio Flower Festival, the majority of the streets are lined with brilliant flowers, making every corner worth the time.",
        "imgItem1": "./img/fest-gallery/panagbenga-img2.jpg",
        "imgItem2": "./img/fest-gallery/panagbenga-img3.jpg",
        "imgItem3": "./img/fest-gallery/panagbenga-img4.jpeg",
        "imgItem4": "./img/fest-gallery/panagbenga-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/speAKKgiKt0",
        "ref": "https://expertworldtravel.com/philippines/panagbenga-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpanagbenga-img1.jpg?alt=media&token=c4e7a817-66c3-436b-9c2b-5b8f2fab71c3",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpanagbenga-img2.jpg?alt=media&token=a97cff5a-60c2-44a0-a6ee-2f2e1fa7e159",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpanagbenga-img3.jpg?alt=media&token=3304f1b0-844f-49da-938e-14ff0f5ee685",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpanagbenga-img4.jpeg?alt=media&token=fb52bea2-f4c0-4946-84b6-9ba672295fb5",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpanagbenga-img5.jpg?alt=media&token=5b4ccf00-9f09-472e-90c6-f1c4a5d9a6dc"
    },
    {
        "title": "Lechon Festival",
        "islandGroup": "luzon",
        "date": "June 24",
        "dateFormat": "2022-06-24",
        "location": "Balayan, Batangas",
        "paragraph1": "The Parada ng Lechon also known as roasted pig parade is a festival you must see in Balayan Batangas. The celebration is held annually on June 24, and the feast day of San Juan (Saint John the Baptist). During the Spanish and American administrations, families that had received substantial graces in the previous year would parade a lechon in the town plaza on June 24th, St. John the Baptist's Feast Day. The best demonstration of appreciation and reverence to their patron saint for the poor people of Balayan is the parade of lechon in the plaza, which is centered on the Roman Catholic Church. The sight of people parading lechons – combined with the centuries-old ritual of water dousing in regions where St Joho the Baptist is the patron saint – was certainly a sight to behold even back then.",
        "paragraph2": "A one-day celebration turned into a two-week affair, with a variety of activities (sports tournaments, singing and dancing competitions, magic and acrobatic shows, bicycle race, battle of the bands, ballroom dancing, beauty pageant, free concerts, fireworks show, and so on) held as a warm-up for the Parada ng Lechon. Aside from the extended celebration, the Hermandad and the hundreds of clubs in the Kanluran neighborhood brought beer drinking and live bands/combos to the streets, as well as enormous streamers/tarpaulins, joyful banners and buntings, colorful uniforms, and souvenir t-shirts. All of these elements combine to create a more profoundly joyous and energized environment throughout the fiesta.",
        "img": "./img/fest-gallery/lechon-img1.jpg",
        "paragraph3": "Lechon is one of Batangas delicacy, and even in other provinces in the Philippines. It’s a main dish most batagueños have for celebrations or fiestas. According to the old villager, lechon was served before the Spanish arrived in the Philippines. The dish became a symbol of Batangas tradition to serve lechon during celebrations.",
        "paragraph4": "Every June 24, local and foreign tourists, small and large businesses, as well as national and international media, rush to Balayan, Batangas to watch and participate in the country's most welcoming, lavish, and distinctive fiesta celebration. Everyone is welcome and free to visit Balayan, Batangas to participate different events that they have.",
        "imgItem1": "./img/fest-gallery/lechon-img2.jpg",
        "imgItem2": "./img/fest-gallery/lechon-img3.jpg",
        "imgItem3": "./img/fest-gallery/lechon-img4.jpg",
        "imgItem4": "./img/fest-gallery/lechon-img5.JPG",
        "ytPath": "https://www.youtube.com/embed/z5R6Ew_uDLw",
        "ref": "http://www.batangas-philippines.com/parada-ng-lechon.html",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Flechon-img1.jpg?alt=media&token=74d0da03-dfbb-46ff-b1c7-bd4706cf5c0e",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Flechon-img2.jpg?alt=media&token=f97ac851-f31f-4b76-9153-f6ca32c94997",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Flechon-img3.jpg?alt=media&token=f31601ce-3c20-4f4f-8ce4-2eef769cc748",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Flechon-img4.jpg?alt=media&token=ec3df7f2-6e52-4e02-a8d8-c5c6761f504c",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Flechon-img5.JPG?alt=media&token=a78949ae-fa9a-456d-ac4c-5a309eb90707"
    },
    {
        "title": "Inug-og Festival",
        "islandGroup": "mindanao",
        "date": "October 9",
        "dateFormat": "2022-10-09",
        "location": "Mindanao",
        "paragraph1": "Layawan was the previous name for Oroquieta. From 1861 to 1879, the current city was a barrio in the Misamis province. Boholano peddlers were among the first settlers. Because there are so many stray animals along the river, the area was given the name Layawan, which means place of numerous stray animals.",
        "paragraph2": "Inug-og Fesitival, an ethnic celebration of the Suban-on culture, is held in conjunction with the city's weeklong festivities. During this time, there are street dancing parades, fairs, and other fiesta activities. It is held on every 14th of October in tribute to city\\’s patron saint, Our Lady of the Holy Rosary.",
        "img": "./img/fest-gallery/inug-og-img1.jpg",
        "paragraph3": "“Inug-og” is derived from a Subanen word “Ug-og,” which means an intense shaking of a person\\’s two (2) shoulders when he/she wants to balance a load placed between them. The Inug-og Festival also exhibits many Lumad customs and lifestyles. It also features the traditional courting of a Lumad Guy to a Lumad Lady involves placing a red cloth on the shoulder of the girl he is intended to court and waiting for her to accept it as a sign that she accepts the guy's offer.",
        "paragraph4": "The celebration pays tribute to the Subanen tribe, who live along the many rivers that run through the Mt. Malindang Ranges Natural Park (MMRNP), at the foot of which Oroquieta, Misamis Occidental's capital, is located.",
        "imgItem1": "./img/fest-gallery/inug-og-img2.jpg",
        "imgItem2": "./img/fest-gallery/inug-og-img3.jpg",
        "imgItem3": "./img/fest-gallery/inug-og-img4.jpg",
        "imgItem4": "./img/fest-gallery/inug-og-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/9lftpeDU3wc",
        "ref": "https://carlomananggit.tumblr.com/post/132054741050/inug-ug-festival",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Finug-og-img1.jpg?alt=media&token=0fde6b53-ae5e-4b9d-a2bb-b95cb6077dab",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Finug-og-img2.jpg?alt=media&token=299baf40-7503-45f2-9297-afc35fc365f9",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Finug-og-img3.jpg?alt=media&token=fe1af4be-a55f-4d47-8b92-99245df821dc",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Finug-og-img4.jpg?alt=media&token=d808ad72-16a1-4dc6-ab6a-44450b99dc3a",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Finug-og-img5.jpg?alt=media&token=30b8ec41-b88c-4b5d-a6dd-c102dfe36a94"
    },
    {
        "title": "Pintaflores",
        "islandGroup": "visayas",
        "date": "November 5",
        "dateFormat": "2022-11-05",
        "location": "San Carlos, Negros Occidental",
        "paragraph1": "San Carlos City’s name during the 17th century was Nabingkalan, which is thought to have come from the name of the Chieftain’s daughter in the Negrito settlement that dominated the barrio at the time. This town was later bought by a Cebu resident, who converted it to a Christian village.",
        "paragraph2": "The city has its own celebration namely Pintaflores festival which held every 5th of November. The festival’s name is derived from the Spanish word pinta that loosely translates to tattoos and flores means flowers. It is celebrated in honor of its patron Saint San Carlos Borromeo.",
        "img": "./img/fest-gallery/pintaflores-img1.jpg",
        "paragraph3": "There are also story behind the uniqueness of festival’s name is piqued by many traveler’s interest. It is said that the festival’s name is comes from the adversity and victory of Princess Nabingka that took the challenge to go to unexplored lands. The festival is based on the event happened with princess. After she settled on the island, she had an illness that required immediate attention. The residents began planting flower beds in the hopes of healing the princess, but the weather had other ideas, and the flowers failed to bloom. As a result, floral tattoos were used to treat the princess, thus the Pintaflores.",
        "paragraph4": "The festival is indeed a joyful event in the city as they celebrate in memory of the beginning of their city. The climax of the festival is a dance ritual performed by locals at the San Carlos City Auditorium. This comprises dancers with flowers painted on their faces, arms, bodies, and legs, as well as human flower formation incorporated into each performance.",
        "imgItem1": "./img/fest-gallery/pintaflores-img2.jpg",
        "imgItem2": "./img/fest-gallery/pintaflores-img3.jpg",
        "imgItem3": "./img/fest-gallery/pintaflores-img4.jpg",
        "imgItem4": "./img/fest-gallery/pintaflores-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/3YJRz55XYWA",
        "ref": "https://expertworldtravel.com/philippines/pintaflores-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpintaflores-img1.jpg?alt=media&token=16e2fd86-b841-4609-af41-8bae44b73f4b",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpintaflores-img2.jpg?alt=media&token=a62315d7-0c01-4a21-8a20-c0d0ca7ae0fe",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpintaflores-img3.jpg?alt=media&token=19ccbf94-f063-4478-a20d-cc4a0bd03716",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpintaflores-img4.jpg?alt=media&token=c832f7e0-2454-4d2f-8d5d-fc68442fb84f",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpintaflores-img5.jpg?alt=media&token=3ad47041-5d68-41de-99ba-342810029b4b"
    },
    {
        "title": "Kalag-Kalag Festival",
        "islandGroup": "visayas",
        "date": "November 13",
        "dateFormat": "2022-11-13",
        "location": "Cebu City",
        "paragraph1": "The Kalag-kalag Festival is held in Cebu City, Cebu, Philippines, and it revives the Filipino tradition of visiting relatives to fondly remember friends and family who have passed away. The thirteenth of November is recognized as All Holy People Day in most parts of the country. Mayor Renato Malabor, who also celebrates his birthday on November 2, created the Kalag-Kalag Festival. The normally gloomy images of coffins and skeletons were transformed into a cleverly staged introduction, transforming the rather upsetting night of All Souls Day into a fantastic night of celebration.",
        "paragraph2": "The festival is unique in that it showcases creatures that many people associate with Halloween. Creatures such as phantoms, aswang, and that’s just the beginning of neighborhood legends told by more experienced people to terrify the young ones. These creatures compete against one another in the Kalag-Kalag festival, where they are used to engage rather than frighten the crowd. Kalag-Kalag derives from the word kalag, which means ghost. It is well-known and often observed throughout the Central Visayas, particularly in Cebu.",
        "img": "./img/fest-gallery/kalag-kalag-img1.jpg",
        "paragraph3": "Most people may expect a festival as a pageantry of bright clothes and a joyful atmosphere. The Kalag-Kalag festival, held every evening on November 2nd, All Souls Day, by the Municipality of Isabela, Negros Occidental, is a one-of-a-kind event.",
        "paragraph4": "",
        "imgItem1": "./img/fest-gallery/kalag-kalag-img2.jpg",
        "imgItem2": "./img/fest-gallery/kalag-kalag-img3.jpg",
        "imgItem3": "./img/fest-gallery/kalag-kalag-img4.jpg",
        "imgItem4": "./img/fest-gallery/kalag-kalag-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/xiFiJWqz_Os",
        "ref": "https://www.hellotravel.com/events/kalag-kalag-festival",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkalag-kalag-img1.jpg?alt=media&token=ac4b3616-24ea-4464-9bbc-bd9d3f9cdd5a",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkalag-kalag-img2.jpg?alt=media&token=f697a7a1-37e9-4520-bf09-ab8a0b319457",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkalag-kalag-img3.jpg?alt=media&token=d9e8d016-b452-4b7a-b437-8a759521d4ee",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkalag-kalag-img4.jpg?alt=media&token=d35770f3-40eb-441b-9efd-dfaaf84eb0e3",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkalag-kalag-img5.jpg?alt=media&token=b453e93f-0f55-4cd9-8a36-57f7de7a8f2b"
    },
    {
        "title": "Kamundagan Festival",
        "islandGroup": "luzon",
        "date": "December 1",
        "dateFormat": "2022-12-01",
        "location": "Naga City, Bicol",
        "paragraph1": "The Kamundagan Festival, a month-long celebration marking Naga’s birth and rebirth, aims to preserve Naga’s history by “looking back” to the city’s old traditional values-laden culture and family life so that current and future generations do not forget their exceptional heritage.",
        "paragraph2": "For the past 25 years, Naga City has hosted the Kamundagan Festival. Following the Penafrancia festival in September, when the entire Kabikolan praised the Virgin Mary for her leadership and guidance in religious activities, Kamundagan (Birth of Baby Jesus or Nativity) is held throughout the month of December.",
        "img": "./img/fest-gallery/kamundagan-img1.jpg",
        "paragraph3": "The nightly parade, which takes place just before the beginning of December and involves 27 barangays from the city, non-governmental organizations, and local business groups, is one of the highlights. The gorgeous and lit chariots portraying the Holy Nativity enliven the parade procession. The parade’s spectators also anticipate kirik-kiti or sparklers.",
        "paragraph4": "The Kamundagan Festival id being promoted by the local government for a combination of tourism and faith. Marian worshippers continue to visit Naga every December, in addition to the Penafrancia.",
        "imgItem1": "./img/fest-gallery/kamundagan-img2.jpg",
        "imgItem2": "./img/fest-gallery/kamundagan-img3.jpg",
        "imgItem3": "./img/fest-gallery/kamundagan-img4.jpg",
        "imgItem4": "./img/fest-gallery/kamundagan-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/p8kIi0VeNYs",
        "ref": "https://naga.gov.ph/naga-smiles-2/kamundagan-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkamundagan-img1.jpg?alt=media&token=e62e7721-ff0a-4f8c-9780-3ea61ed089ca",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkamundagan-img2.jpg?alt=media&token=c78da465-df8f-4efa-b98b-9a39ae454bae",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkamundagan-img3.jpg?alt=media&token=02d1fc50-9b3a-44f0-9d72-6aa330579cc1",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkamundagan-img4.jpg?alt=media&token=aecc0617-9144-4264-8746-c18350a1ac12",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkamundagan-img5.jpg?alt=media&token=94af3927-3db3-46b3-871c-a642a455f74e"
    },
    {
        "title": "Sinadya sa Halaran Festival",
        "islandGroup": "visayas",
        "date": "December 3",
        "dateFormat": "2022-12-03",
        "location": "Roxas City, Capiz",
        "paragraph1": "The Sinadya sa Halaran Festival is a collaboration between Roxas City and Capiz Province. It’s a mash-up of a holiday in that it’s celebrated for both social and religious purposes. It is recommended during the first few days of December in honor of the Feast of the Virgin of the Immaculate Concepcion, who is also the patroness of Roxas.",
        "paragraph2": "The vast procession of festivities, the fluvial motorcade, and the lit waterway floaters are just a few of Sinadya sa Halaran’s colorful exercises. There’s also the traditional fish feast and a spectacular pyrotechnic show.",
        "img": "./img/fest-gallery/sinadya-img1.jpg",
        "paragraph3": "In the local tongue, Sinadya sa Halaran translates as “joy in sharing and appreciation.” The Sinadya and the Halaran, which were previously celebrated separately, now share the spotlight during the first weekend of December. The Roxas city group says there’s a lot to be thankful and share, and it’s all in this wonderful celebration, which includes “Diana” fireworks display, a gourmet festival, and a magnificent dance festival.",
        "paragraph4": "Sinadya sa Halaran is one Roxas City’s most important annual event, and it is a mash-up of two festivals – “Sinadya” City and “Halaran” Province – that fully encapsulates joy in sharing and thanksgiving. On December 4 – 8, it is recommended that you remember the religious rituals that characterize a true Capiceo soul. The dancing parade, “Higantes”, Fluvial Parade, Firework show, Mutya sa Halaran grandeur event, Coronation of the Fiesta Queen, and Agri-Aqua Trade Fair are among the festival’s highlights.",
        "imgItem1": "./img/fest-gallery/sinadya-img2.jpg",
        "imgItem2": "./img/fest-gallery/sinadya-img3.jpg",
        "imgItem3": "./img/fest-gallery/sinadya-img4.jpg",
        "imgItem4": "./img/fest-gallery/sinadya-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/R1WtsxU-IDc",
        "ref": "https://whyretiretothephilippines.com/sinadya-sa-halaran-is-a-two-in-one-celebration/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsinadya-img1.jpg?alt=media&token=e7a70ef5-fcba-4be6-8adb-3b94a48dff92",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsinadya-img2.jpg?alt=media&token=43ead4e0-1915-4b76-be78-e423d5a995c4",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsinadya-img3.jpg?alt=media&token=633e2273-a2ac-4712-ac14-ca6783ce2f9c",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsinadya-img4.jpg?alt=media&token=c7dd2ae3-1de9-45e8-8d25-1d66190b5b6f",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsinadya-img5.jpg?alt=media&token=49f6270d-dbae-4de8-ba5c-7fe02c256a91"
    },
    {
        "title": "Giant Lantern Festival",
        "islandGroup": "luzon",
        "date": "December 17",
        "dateFormat": "2022-12-17",
        "location": "San Fernando, Pampanga",
        "paragraph1": "The Giant Lantern Festival, also known as Ligligan Parul, is an annual event held in San Fernando during the month of December, which is the Philippine’s Christmas season. The festival’s primary attraction is the Giant Lantern Festival Competition, which takes place in mid-December. This is a competition amongst enormous lantern designers.",
        "paragraph2": "This is a century-old festival in the Philippines that began in 1904. However, the old locals believed that the event was inaugurated in 1904, but it was initialized or instantiated during the late years of 1908. The inaugural Giant Lantern Festival was held to commemorate Manuel L. Quezon, during his term. That’s because, at the time, President Quezon transformed and opened the famed Mount Arayat National Park, which paved the path for tourism in the city, allowing the residents to prosper.",
        "img": "./img/fest-gallery/giant-lantern-img1.jpg",
        "paragraph3": "Locals utilized lanterns that were only around 2 feet in diameter back in the day. However, as the annual celebration grows in size and scope, improvements were made, and it becomes increasingly larger and more illuminated. In fact, many lanterns now have rotors to enable for lantern movement while also optimizing lighting effects.The lanterns used today are no smaller than 15 feet in diameter. That’s five times the original size, and there are still those that want to perfect and build a much larger lantern to keep breaking the record.",
        "paragraph4": "The large crowd pour out into the town plaza and onto surrounding streets and alleys, virtually body to body. Children and adults alike climb trees or stand on outdoor tables, chairs, vehicle, and jeep roofs, and rooftops to obtain a better view of the Giant Lantern Festival’s dramatic competition and beautiful parade.",
        "imgItem1": "./img/fest-gallery/giant-lantern-img2.jpg",
        "imgItem2": "./img/fest-gallery/giant-lantern-img3.jpg",
        "imgItem3": "./img/fest-gallery/giant-lantern-img4.jpg",
        "imgItem4": "./img/fest-gallery/giant-lantern-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/9oy6hqXSnME",
        "ref": "https://expertworldtravel.com/philippines/giant-lantern-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fgiant%20lantern-img1.jpg?alt=media&token=2e2468be-b822-40e9-bfef-6a63af35aec1",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fgiant%20lantern-img2.jpg?alt=media&token=0b4cd57f-aec2-4769-9d16-e4c8d387c61d",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fgiant%20lantern-img3.jpg?alt=media&token=a4df1ebe-1781-46dc-9f2d-7679f382555c",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fgiant%20lantern-img4.jpg?alt=media&token=e65f38f3-6fda-4583-a827-41b6d21f305e",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fgiant%20lantern-img5.jpg?alt=media&token=884e8419-bb03-479a-a70d-07d89168f6bf"
    },
    {
        "title": "Shariff Kabunsuan Festival",
        "islandGroup": "mindanao",
        "date": "December 15-19",
        "dateFormat": "2022-12-15",
        "location": "Cotabato City",
        "paragraph1": "The annual Shariff Kabunsuan Festival, a four-day long festival, which held on 15th of December, features parades, dancing, business forums, exhibits, and feasts in honor of Shariff Muhammad Kabunsuan, an Arab missionary from Malaysia who introduced Islam to Mindanao in the 13th century, long before Spaniards brought Christianity to the Visayas.",
        "paragraph2": "The Guinakit Fluvial Parade, which incorporates a reenactment of Shariff Kabunsuan’s arrival to Rio Grande de Mindanao, the island’s second-largest river, located in Cotabato City, kicks off the celebration.",
        "img": "./img/fest-gallery/shariff-img1.jpg",
        "paragraph3": "The Arab missionary was supposed to traveled aboard a brightly colored boat known as guinakit. It has been the sailing vessel of Muslim ruler for many years. The guinakit is decorated for the parade which flaglets and brightly colored textiles.",
        "paragraph4": "This festival is significant in Cotabato City, and people are looking forward to the different activities planned for the week-long celebration. Cultural perfomances, Alimango Festival, Muslim Culinary Arts Competition, cultural musical showdown, Kulintang Ensemble Competition, Philippine Acrobatic Show, Inaul Fashion Show, and Photo Exhibit Contest are among the events.",
        "imgItem1": "./img/fest-gallery/shariff-img2.jpg",
        "imgItem2": "./img/fest-gallery/shariff-img3.jpg",
        "imgItem3": "./img/fest-gallery/shariff-img4.jpg",
        "imgItem4": "./img/fest-gallery/shariff-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/92joZLr_AXE",
        "ref": "https://www.a1-philippine-travel-asia.com/kabunsuan-festival.html",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fshariff-img1.jpg?alt=media&token=c1502f3a-098a-476e-9c44-30caa33ee930",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fshariff-img2.jpg?alt=media&token=c128bbe5-51e1-4caa-8497-1d6f07f0202a",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fshariff-img3.jpg?alt=media&token=ced66a4d-6baf-468d-92fd-a0a84d198576",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fshariff-img4.jpg?alt=media&token=afda6900-c67f-49d3-b495-c457085cc406",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fshariff-img5.jpg?alt=media&token=8cf7de38-5212-4925-8a8e-461cce2bc63a"
    },
    {
        "title": "Pasalamat Festival",
        "islandGroup": "visayas",
        "date": "May 1",
        "dateFormat": "2022-05-01",
        "location": "La Carlota City",
        "paragraph1": "The City of La Carlota, located in the province of Negros Occidental is also famous when it comes to their festival celebration. They have the “Pasalamat Festival” which primarily aims to feature the pride of talents, skills, and products of the La Carloteños, or the locals of La Carlota. Thus, embodying its title as the “Drumbeating City of Beauty, Music, and Dance.” It is also the place where the oldest and the most famous sugar mill in the province located and the birthplace of prominent boxing champions. The place is rich in agriculture, made use of rice for their consumption and of tobacco as a form of business in export.",
        "paragraph2": "Tracing the history of the place, the early settlement or civilization of La Carlota started in the Candaguit riverbank. Later, on the year 1856, that was the only time that the village called Mampunay was recorded by the historians followed by appointment given by the parish priest of a specific place to be a site of the settlement is called Simancas. During the Spanish occupation, the barrio of Simancas was merged with the municipality of Valladolid, and it was only removed from such merging in the year 1871 when the King of Spain declared a decree stating that Simanca will be a separate town. The followers of the King Carlos of Spain also called the “Carlistas” requested the creation of the place as a parish and it was granted in the year 1876. Moreover, the La Carlota was created as a chartered city in the year 1965.",
        "img": "./img/fest-gallery/pasalamat-img1.jpg",
        "paragraph3": "The Pasalamat festival aims to look back to the past cultural and traditional heritage of the town as evident in the different prepared activities and competitions. This week-long celebration will surely be a hit for those who are looking for a different and higher level of vacation. So what are the activities and competitions at this festival? Some of which are the Dog Walk at the Festival Park, Muneco Vistuaro or the Doll Costume Design Competition, Rollo Y Pinta or the on the spot painting contest, Pyromusical competition, and the Football Invitation Cup.",
        "paragraph4": "They also have varied sports exhibition and tournament activities like Basketball, Shootfest, Tennis, Chess, Billiard, Palarong Panlahi, Pawasak, Marathon, Karatedo, Mountain Bike, and Boxing. Other exciting activities and competitions also include Battle of the Bands, SMB Night Street Party, Rhythm Competition, Awit-Sayaw Extreme Night, Party at the Park, Trisikad Race, Dog Show Competition, 1-Clock Timbangan, Festival Dance and Float Parade, Arena Dance Competition, and the Festival Queen. Of course, as a place rich in agriculture, there is also the “Agro-Trade Fair” whereas all the native products and delicacies of the locals will be presented and are both ready for exhibit and for sale. The rich cultural and historical heritage of the town gave a massive contribution to the way they celebrate their Pasalamat Festival. It is a reflection of how beautiful their town is despite all the circumstances that they have been through. Come, join, and enjoy the Pasalamat Festival.",
        "imgItem1": "./img/fest-gallery/pasalamat-img2.jpg",
        "imgItem2": "./img/fest-gallery/pasalamat-img3.jfif",
        "imgItem3": "./img/fest-gallery/pasalamat-img4.jpg",
        "imgItem4": "./img/fest-gallery/pasalamat-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/21jvPJ4CuCs",
        "ref": "https://thehappytrip.com/2016/05/pasalamat-festival-2016/#_PASALAMAT_FESTIVAL_SCHEDULE_OF_EVENTS_LA_CARLOTA_CITY",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpasalamat-img1.jpg?alt=media&token=207b14b4-1255-4442-9282-460c36ca1e3b",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpasalamat-img2.jpg?alt=media&token=2f50b726-19d8-46d1-b35d-6170ea3fad11",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpasalamat-img3.jfif?alt=media&token=74868d8a-f1de-4906-9b15-d03483aad361",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpasalamat-img4.jpg?alt=media&token=ba86c349-3b02-44d0-8053-0f7a864eb923",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpasalamat-img5.jpg?alt=media&token=e943cab1-1817-4977-92fd-82242d57c032"
    },
    {
        "title": "Kuyamis Festival",
        "islandGroup": "mindanao",
        "date": "January 9",
        "dateFormat": "2022-01-09",
        "location": "Cagayan De Oro, Misamis Oriental",
        "paragraph1": "Staged every second week of January, Kuyamis Festival is being celebrated annually as a Founding Anniversary of Misamis Oriental. Kuyamis Festival is derived from the coconut, locally called Kuyamis which is very abundant all throughout Misamis Oriental, from the Municipality of Lugait in the west to the Municipality of Magsaysay in the east, coconut trees are very visible when you travel around the Province.",
        "paragraph2": "History revealed that Kuyamis is the original name of Misamis, it is a variety of sweet coconut. Which was the staple food of the earliest known Negritos settlers of Misamis. The word Kuyamis was later corrupted to Misamis when Christianity was yet new in the Philippines. One of the main sources of livelihood in the province is coconut production. Based on the data released by the Philippine Coconut Authority, Misamis Oriental ranks number 5 among the top 10 major coconut producers of the country, with 102,622 hectares planted with coconut that makes one of the remarkable economic contributions to the province of Misamis Oriental.",
        "img": "./img/fest-gallery/kuyamis-img1.jpg",
        "paragraph3": "In fact, one of the export-oriented manufacturers of premium coconut products with a thrust of maximizing the almost limitless potential of the coconut and of developing a full line of fine coconut-based food ingredients is situated in the Municipality of Medina, Misamis Oriental - the Axelum Resources Corp. that produces the Fiesta Brands.",
        "paragraph4": "That is why Misamis Oriental takes its pride to celebrate the full potential of coconut as their main focus of the festival and of course together with its indigenous people. The Father of Kuyamis Festival, Governor Bambi Emano is right of giving honor to Kuyamis or the Coconut through this festival because it is one of the main sources of income to the province as it generates the province's export earnings. The festival is also a way of thanksgiving for the bountiful blessings the coconut continues to give to the province, the celebration of the rich culture and of course the people of Misamis Oriental. So, right after our New Year celebrations, the fun doesn't end there because Misamis Oriental continues the fun and excitement with their series of activities for this year's Kuyamis Festival activities.",
        "imgItem1": "./img/fest-gallery/kuyamis-img2.jpg",
        "imgItem2": "./img/fest-gallery/kuyamis-img3.jpg",
        "imgItem3": "./img/fest-gallery/kuyamis-img4.jpg",
        "imgItem4": "./img/fest-gallery/kuyamis-img5.png",
        "ytPath": "https://www.youtube.com/embed/_hGsGFbsiY4",
        "ref": "http://www.traveltrilogy.com/2019/02/kuyamis-festival-cagayan-de-oro.html",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkuyamis-img1.jpg?alt=media&token=a1bc955a-dd54-4584-aec6-1c9b49360a40",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkuyamis-img2.jpg?alt=media&token=94904a76-46c8-42eb-88d6-bdc7741a5984",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkuyamis-img3.jpg?alt=media&token=63f1c52f-ee19-4051-8dfe-13f774c440d9",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkuyamis-img4.jpg?alt=media&token=a751653b-33c6-4d8d-841a-efac9ced6bec",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkuyamis-img5.png?alt=media&token=ae8c0de9-e7e5-4dcf-82fd-69f7a8cf6a2b"
    },
    {
        "title": "Lubid Festival",
        "islandGroup": "luzon",
        "date": "July 8-16",
        "dateFormat": "2022-07-08",
        "location": "Malilipot, Albay",
        "paragraph1": "The streets of this city became a living display of the many forms that the town’s most famous product, abaca, can take a giant chair, a giant jar, a giant gown.Abaca was unmistakably the star of the show as the town celebrated its Lubid (Rope) Festival every year of July 8-16. Now in its fourth year, Lubid Festival (July 1-16) seeks to promote abaca and the town’s other products in the country and abroad.",
        "paragraph2": "Emma Bordeos, Malilipot tourism officer, said the town sent out street dancers in colorful costumes and paraded giant handicraft products to showcase the craft of artisans and the hard work of abaca farmers.She said 65 percent of the town’s population is directly involved in handicraft production, particularly the abaca twine.",
        "img": "./img/fest-gallery/lubid-img1.jpg",
        "paragraph3": "This is our way of promoting other lubid products such as bags, which is already a known product in demand in the local and international market,” she said.Now in its fourth year, Lubid Festival (July 1-15) seeks to promote abaca and the town’s other products in the country and abroad",
        "paragraph4": "Emma Bordeos, Malilipot tourism officer, said the town sent out street dancers in colorful costumes and paraded giant handicraft products to showcase the craft of artisans and the hard work of abaca farmers.She said 65 percent of the town’s population is directly involved in handicraft production, particularly the abaca twine.“This is our way of promoting other ‘lubid’ products such as bags, which is already a known product in demand in the local and international market,” she said.",
        "imgItem1": "./img/fest-gallery/lubid-img2.jpg",
        "imgItem2": "./img/fest-gallery/lubid-img3.jpg",
        "imgItem3": "./img/fest-gallery/lubid-img4.jfif",
        "imgItem4": "./img/fest-gallery/lubid-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/Euqwq6ZNGFE",
        "ref": "https://newsinfo.inquirer.net/705721/lubid-takes-center-stage-in-town-fiesta",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Flubid-img1.jpg?alt=media&token=89b8a6d8-aca3-4e51-b5f5-12c08ab46f71",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Flubid-img2.jpg?alt=media&token=abcc957a-540c-41aa-9746-371a5c4c70f5",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Flubid-img3.jpg?alt=media&token=e4492903-283f-4e16-8dc4-3742d342916c",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Flubid-img4.jfif?alt=media&token=bb425a24-e66e-4fe8-bf27-261df53fd0eb",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Flubid-img5.jpg?alt=media&token=4edc11f3-b991-4dba-866b-84e6fa0dacb6"
    },
    {
        "title": "Pasungay Festival",
        "islandGroup": "visayas",
        "date": "January 15",
        "dateFormat": "2022-01-15",
        "location": "San Joaquin, Iloilo City",
        "paragraph1": "San Joaquin had been holding the annual Pasungay during the third Saturday of January in time of the town’s fiesta, Iloilo 1st District Board Member Marcelo Valentin Serag said in a phone interview. The festival was called off this year due to the animal cruelty claims of some animal welfare groups. It is almost a year that Pasungay had been called off, and until now we still do not have a clear explanation if it is legal or not, he said. On Tuesday, Serag has brought up the matter during the SP's regular session. We want to open the issue again to seek help from the concerned agencies to help us bring back Pasungay, he said.",
        "paragraph2": "In his speech, Serag said then-Iloilo provincial veterinarian Silvino Teodosio commented that bullfighting in San Joaquin is not a blood sport but “is more of a wrestling match where each side comprises a bull and his human trainer.” Section 6 of the Animal Welfare Act states that: “Prohibition on animal fights -- it is prohibited to subject animals to fight such as, but not limited to dogfighting, horse fighting, and bullfighting. A person must not a) cause procure, permit, encourage, promote, organize or incite a fight in which an animal is pitted against another animal for whatever purpose or reason; b) advertise promote the intention to conduct such a fight...”.",
        "img": "./img/fest-gallery/pasungay-img1.jpg",
        "paragraph3": "“Despite the name, Pasungay in San Joaquin is anything but bloodless. It is not a blood sport. The animal involved do not attempt to head-butt nor attempt to use its horn to impale, puncture or piece any part of the body of its opponent,” he said, citing Teodosio. In line with this, Serag mulls to pass a resolution to the Department of Agriculture (DA) to revisit the Implementing Rules and Regulations of the Animal Welfare Act and to “reevaluate its conformity with the spirit of the Act, and if so warrants, to categorically state that Pasungay is not covered by the definition or contemplation of prohibited animal fights for is not bullfighting per se and that is part of culture that will be afforded due respect and allowed to flourish.”",
        "paragraph4": "The board member wants the National Commission for Culture and the Arts (NCCA) to declare the practice of Pasungay as “a long-time practice and part of the culture and tradition of San Joaquinhons. This for it to “be allowed to flourish in a climate of freedom and responsibility true to the ideals of culture as a human right, Serag said. The move to pass a resolution for the NCCA was also encouraged by the Department of Tourism in Western Visayas, as implored by the Sangguniang Bayan of San Joaquin in its resolution number 2019-13. “The festival should be founded upon a definite declaration of cultural significance for an argument favoring its continuity to succeed,” the DOT 6 said. Serag is hopeful that Pasungay will be staged again this year to showcase the culture, history, and legacy of San Joaquinhons to local and foreign tourists.",
        "imgItem1": "./img/fest-gallery/pasungay-img2.jpg",
        "imgItem2": "./img/fest-gallery/pasungay-img3.jpg",
        "imgItem3": "./img/fest-gallery/pasungay-img4.jpg",
        "imgItem4": "./img/fest-gallery/pasungay-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/a_VIjDcv3io",
        "ref": "https://www.pna.gov.ph/articles/1086010",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpasungay-img1.jpg?alt=media&token=211c29f0-90ee-439b-b5f6-6ac6a83acc64",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpasungay-img2.jpg?alt=media&token=294e1da1-727d-4774-b910-46418ba906d0",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpasungay-img3.jpg?alt=media&token=8cfe2848-bfbd-4945-bc09-4ef61c64bb41",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpasungay-img4.jpg?alt=media&token=ba43e7bf-3582-4806-a950-defeb6b10e0e",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpasungay-img5.jpg?alt=media&token=26182927-7150-490f-bf1c-eb6a4be98501"
    },
    {
        "title": "Caracol Festival",
        "islandGroup": "luzon",
        "date": "February 25",
        "dateFormat": "2022-02-25",
        "location": "Makati City",
        "paragraph1": "The financial center of the Philippines, the Makati City, celebrates its annual Caracol Festival during the last week of February every year. Unlike any other festivals in the country that has long been formulated, Caracol festival of Makati City has just recently declared as the City’s official festival. Makati is the house of the countries multinational and local corporations. There are a lot of the country’s major banks, department stores and foreign embassies lays at the streets of Makati. It is also the biggest Philippine Stock Exchange trading center. Makati is also known for its agricultural and entertainment industry.",
        "paragraph2": "According to history, Governor General of the Philippines Miguel Lopez de Legaspi during the Spanish colonial period had explored the swamps of the Pasig River once. He wanted to know the name of the place so he asked a native. But due to language barrier the native misunderstood his question to be in regards of the tide, so the native answered him “Makati, kumakati na” which means “Ebbing, the tide is ebbing.” From then on, Legaspi addresses the area as Makati. Distinct from other Philippine Festivals, the Caracol festival of Makati is in honor to Mother Nature’s preservation. It was only conceived in the year 1989 during the pursuit of the Department of Tourism of its Island Fiestas program. And on January 21, 1991, the local government of Makati declared Caracol Festival as the City’s official festival.",
        "img": "./img/fest-gallery/caracol-img1.jpg",
        "paragraph3": "Caracol is a Spanish word that means snail. It becomes the symbolic representation of the festival as Makati people views the shell of the snail as a protection from the misfortunes that life brings. The idea that depicts the snails shell was adapted to the annual festival of the city. The Caracol festival is held through a tribal dance competition usually composed of students of different school divisions and levels in Makati. Each usually has over 30 to 50 number of participants. Having the theme in-lined with nature, the participants are dressed in colorful flowers, plants, exotic animals, aquatic creatures, forest animals and other ornaments and organisms connected to nature. They are judge in terms of their costumes, choreography, and their overall performance. The high light of the event is the street dance competition and the best in costume competition among the participants.",
        "paragraph4": "This festival shows that Filipinos aside from its religious inclination has a way to celebrate and be thankful of the abundance of nature. Beside from being a highly developed in terms of its infrastructural and modernized facilities of Makati they haven’t missed a chance to appreciate still the beauty of nature, thus they pursue and promotes its preservation through their yearly festival. Another colorful and extravagant festival we all have to be proud of. Let us continue to promote the preservation of Mother Nature, by supporting Caracol festival.",
        "imgItem1": "./img/fest-gallery/caracol-img2.jpg",
        "imgItem2": "./img/fest-gallery/caracol-img3.jpg",
        "imgItem3": "./img/fest-gallery/caracol-img4.jpg",
        "imgItem4": "./img/fest-gallery/caracol-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/LqKaCIzDuTY",
        "ref": "https://lagawan.org/the-caracol-festival-of-makati-city/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcaracol-img1.jpg?alt=media&token=48d8419c-9289-4db1-b4e2-4f83c7843b65",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcaracol-img2.jpg?alt=media&token=a50956e7-4ecb-4338-ba20-7928fab1d977",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcaracol-img3.jpg?alt=media&token=3bd61c4a-8042-49b5-8e12-b435732a72c8",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcaracol-img4.jpg?alt=media&token=5f024f99-4513-44d0-abfc-8e47b4dc063b",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcaracol-img5.jpg?alt=media&token=1edde645-44e6-4eca-8fd9-95db748bc918"
    },
    {
        "title": "Kinabayo Festival",
        "islandGroup": "mindanao",
        "date": "July 24",
        "dateFormat": "2022-07-24",
        "location": "Dapitan City",
        "paragraph1": "Kinabayo festival is an amazing event on Dapitan City’s social calendar. The event is held every year, with tourists thronging to this location. While Dapitan City is best known for its amazing history as home to the location where national hero and symbol of struggle, Dr. Jose Rizal was exiled, it is also home to amazing festivals such as Kinabayo. Dapitan is one of the few predominantly Catholic cities in the Mindanao region of the Philippines, and every year, almost 95% of the 75,000 residents of the city take part in a mix of traditional and exotic celebrations for the Kinabayo Festival.",
        "paragraph2": "While Dapitan City is best known for its amazing history as home to the location where national hero and symbol of struggle, Dr. Jose Rizal was exiled, it is also home to amazing festivals such as Kinabayo. Dapitan is one of the few predominantly Catholic cities in the Mindanao region of the Philippines, and every year, almost 95% of the 75,000 residents of the city take part in a mix of traditional and exotic celebrations for the Kinabayo Festival.",
        "img": "./img/fest-gallery/kinabayo-img1.jpg",
        "paragraph3": "Kinabayo festival is held to celebrate the Patron Saint, St. James the Greater. At the core of the festival is the reenactment of the Spanish-Moorish wars, the Battle of Clavijo, previously known as the Battle of Covadonga in 722 AD.During this war, St. James the Great (also known as Senor Santiago in Dapitan) was said to show an apparition riding a horse and holding a sword. He was leading the Spanish to victory against the Moors. This story was adapted in Dapitan, which used to be overrun with Moorish pirates. When the Spanish Jesuit missionaries arrived, they sought the help of St. James the Greater to defeat the Moors. The Christian defenders were victorious against the Moorish pirates.",
        "paragraph4": "Since then, the Dapitanos have always re-enacted the Battle of Covadonga in honor of the intervention of St. James the Greater that also freed the city. The Kinabayo Festival is also considered a feast in honor of St. James the Greater, thus the local chant of “Viva Senor Santiago!” throughout the festival.",
        "imgItem1": "./img/fest-gallery/kinabayo-img2.jpg",
        "imgItem2": "./img/fest-gallery/kinabayo-img3.jpg",
        "imgItem3": "./img/fest-gallery/kinabayo-img4.jpg",
        "imgItem4": "./img/fest-gallery/kinabayo-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/W0GYK5pbyCk",
        "ref": "https://expertworldtravel.com/philippines/kinabayo-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkinabayo-img1.jpg?alt=media&token=fc017f20-9d80-4271-8526-cb6887c73d31",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkinabayo-img2.jpg?alt=media&token=8d2900b8-c849-4dec-826d-85fe0b4b289d",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkinabayo-img3.jpg?alt=media&token=76f2c5cc-ddc9-4804-9e8a-55f8e87cb2be",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkinabayo-img4.jpg?alt=media&token=ea22e0d2-7267-45d8-b163-2a377052d2e9",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkinabayo-img5.jpg?alt=media&token=997b7f76-c49f-4654-a65b-e918c7b3cfa0"
    },
    {
        "title": "Mahaguyog Festival",
        "islandGroup": "luzon",
        "date": "Last week of February",
        "dateFormat": "2022-02-27",
        "location": "Luzon",
        "paragraph1": "Mahaguyog, the mixed word for “Mais, Halaman, Gulay, Niyog”, is a festival annually celebrated in the Municipality of Sto. Tomas to honor the bountiful blessing showered to the town. It’s usually celebrated at the last week of February to March 7. The origin of the festival dates back on early days where vast plantations of corn or Mais creates a golden shine on the fields of Sto. Tomas. It is told that the town is really known for being an exporter of good quality corns. As time goes by, more and more crops were being tilled one by one on the land of Sto. Tomas. The merriments praise the plenitude of the place that is settled at the slants of Mt. Makiling and the Mt. Malarayat mountain ranges. Santo Tomas in Batangas commenced its 12-day opening salvo Sunday for the Mahaguyog Festival with the novice singing qualifying rounds in recognition of the 347th town holiday festivity which falls on March 7. The novice singing rivalries supported the senior subjects and the elderly for the “Puwede Pa Kami” classification and the kids' Bulilit classification.",
        "paragraph2": "The two-week recognition will likewise highlight the road moving, mardi gras, serenata, band sticking or Rakrakan Blues, smaller than normal band and parade rivalry, scaled down games challenge, agroexchange reasonable and barangayan, excellence exhibition, theatrical presentation and the firecrackers display. The festivity began February 24 and will end up until March 7 for the devour day of Saint Thomas Aquinas, the town's supporter holy person. Coordinators for the Santo Tomas festivity have booked the day by day mass and the novena inferable from its prevalently Catholic populace. As brilliant and abundant as the vegetation that possess large amounts of the town, the Mahaguyog Festival is a word subsidiary of the compression of the town's fundamental items, for example, mais corn, halaman plant, gulay vegetables and niyog coconut.",
        "img": "./img/fest-gallery/mahaguyog-img1.jpg",
        "paragraph3": "The merriments praise the plenitude of the place that is settled at the slants of Mt. Makiling and the Mt. Malarayat mountain ranges. Santo Tomas in Batangas commenced its 12-day opening salvo Sunday for the Mahaguyog Festival with the novice singing qualifying rounds in recognition of the 347th town holiday festivity which falls on March 7. The novice singing rivalries supported the senior subjects and the elderly for the Puwede Pa Kami classification and the kids' Bulilit classification. The two-week recognition will likewise highlight the road moving, mardi gras, serenata, band sticking or Rakrakan Blues, smaller than normal band and parade rivalry, scaled down games challenge, agro-exchange reasonable and barangayan, excellence exhibition, theatrical presentation and the firecrackers display. The festivity began February 24 and will end up until March 7 for the devour day of Saint Thomas Aquinas, the town's supporter holy person. Coordinators for the Santo Tomas festivity have booked the day by day mass and the novena inferable from its prevalently Catholic populace. As brilliant and abundant as the vegetation that possess large amounts of the town, the Mahaguyog Festival is a word subsidiary of the compression of the town's fundamental items, for example, mais corn, halaman plant, gulay vegetables and niyog coconut.",
        "paragraph4": "Batangas is a province of hardworking people, and this is why it is also among the nation’s most progressive provinces. This is not to say that Batangueños do not have a celebratory nature. On the contrary, although the renowned provincial festival, the famous Ala Eh Festival, is known throughout the archipelago, most of Batangas’ cities and municipalities celebrate their own festivals. In this post, we list the festivals of Batangas for the benefit of those who may just be looking for a reason to pay this great province a visit. Please note that these festivals are predominantly planned by the tourism councils or offices of the different cities and towns of Batangas, and may change not only dates but also names over time.",
        "imgItem1": "./img/fest-gallery/mahaguyog-img2.jpg",
        "imgItem2": "./img/fest-gallery/mahaguyog-img3.jpg",
        "imgItem3": "./img/fest-gallery/mahaguyog-img4.jpg",
        "imgItem4": "./img/fest-gallery/mahaguyog-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/pK2KZUUmLME",
        "ref": "https://pdfcoffee.com/mahaguyog-festival-pdf-free.html",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmahaguyog-img1.jpg?alt=media&token=136a29bc-f77b-48dc-9929-8b8d068c3763",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmahaguyog-img2.jpg?alt=media&token=1afa53f4-0616-4f88-bc2e-3c84459d3aae",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmahaguyog-img3.jpg?alt=media&token=38258087-987c-4507-ac2f-75d41ecda072",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmahaguyog-img4.jpg?alt=media&token=32597873-4766-4b6c-8f9d-4413c79691b4",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fmahaguyog-img5.jpg?alt=media&token=f4a893e1-484d-4ef3-a28f-cca516d078a7"
    },
    {
        "title": "Suman Festival",
        "islandGroup": "luzon",
        "date": "February 14-19",
        "dateFormat": "2022-02-14",
        "location": "Baler Aurora, Quezon",
        "paragraph1": "The “SUMAN FESTIVAL” is the biggest and grandest of all feasts in Baler, Aurora with a weeklong celebration from February 14 – 19. It features parade of floats uniquely designed, main streets and homes are decked with suman (a native delicacy), trade exhibits, fairs and competitions, and capped by the Search for Ms. Aurora.",
        "paragraph2": "Suman is the Filipino steamed rice cake. It comes in as many different forms as there are provinces, but the basic recipes is waxy (sweet) rice wrapped in leaves, then cooked. Suman is the ritual gift of HAGISAN. It is cooked with great enthusiasm by Tayabenses because Hagisan is an opportunity to share their prosperity. Bundles of suman are gaily tied in the pabitin, which is made out of a special kind of bamboo called bagakay.",
        "img": "./img/fest-gallery/suman-img1.JPG",
        "paragraph3": "Baler is one of the most beautiful and tranquil places to visit in Aurora. For people who visited here already, they knew exactly the different attractions offered for both local and foreign tourists. During the month of February, Baler celebrates an annual event to recognize the anniversary of the province and experience the HAGISAN activity, which feature their homemade Suman (a kind of steamed rice cake native delicacy) hanging on the main streets",
        "paragraph4": " ",
        "imgItem1": "./img/fest-gallery/suman-img2.JPG",
        "imgItem2": "./img/fest-gallery/suman-img3.JPG",
        "imgItem3": "./img/fest-gallery/suman-img4.JPG",
        "imgItem4": "./img/fest-gallery/suman-img5.JPG",
        "ytPath": "https://www.youtube.com/embed/WVrJTztWuRw",
        "ref": "http://www.traveltothephilippines.info/2018/09/12/the-grand-suman-festival-celebration-in-aurora/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsuman-img1.JPG?alt=media&token=b2be3182-6229-422c-967b-6ab1bb07f84",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsuman-img2.JPG?alt=media&token=b350c572-e110-44c7-adcc-b103385b11b7",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsuman-img3.JPG?alt=media&token=a52f56da-1485-4aa4-a216-ffa319134fdd",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsuman-img4.JPG?alt=media&token=51af2add-c611-4dea-9969-78a866fd4b8a",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsuman-img5.JPG?alt=media&token=04f7e5fb-e616-4150-a741-523a41a8ea03"
    },
    {
        "title": "Tinagba Festival",
        "islandGroup": "visayas",
        "date": "February 11",
        "dateFormat": "2022-02-11",
        "location": "Iriga City, Camarines Sur",
        "paragraph1": "Tinagba Festival is an annual event. It is held in February, in Iriga City of Camarines Sur province. The main point of this festival is for locals to offer their first harvest of the year, as a celebration. This tradition has existed for many years – it is because of this pagan ritual that this amazing event still exists today. Tinagba Festival also coincides with Our Lady of Lourdes feast, so there is still some religious significance to it. But, the fact that this festival was a pagan ritual makes it clearly distinct from the array of religious festivals that the Philippines is best known for. The interesting thing is that. as much as the ritual is pagan in origin, it is celebrated by locals across the religious divide. The roots of the festival actually come from the earliest Bicolans, who would offer their harvest to the gods, as a way of thanking them and asking for the next harvest to be even more abundant.",
        "paragraph2": "But nowadays, that has drastically changed to include the activities we’re used to seeing in other Filipino festivals, like street dancing. beauty contests, parades, and sports competitions. It is actually impossible to talk about the Tinagba Festival without making mention of the elaborate parades that are characteristic of this festival. The locals bring out their best bull carts and motorized floats which are managed by men and women in traditional regalia that is just as colorful. And that’s just the tip of the iceberg. The Tinagba Festival includes many other side events, that you can participate in, or just observe. There’s the Extreme Bike Challenge, suitable only for the most avid mountain bikers. The 30-kilometer race is a thrilling event that anyone can participate in, as long as they register on time.",
        "img": "./img/fest-gallery/tinagba-img1.jpg",
        "paragraph3": "One thing that’s actually pretty great about this festival is that the activities change from year to year. Apart from the street dancing and the float parade, the only thing that’s become a staple in the last decade is the mountain biking race. All of the other events differ from year to year, so you really can’t be sure what to expect. Some of the events that were part of the festival in the last decade are beauty contests, film showings, photography contests, talent festivals, fireworks display, and many others. In fact, in 2019, the festival also included an invitational billiard tournament, where you got an opportunity to play with Iriga City’s mayor. The politicians and the government are heavily involved in the festival, and just with the funding. They organize some sort of conference for elementary and high school goers every year, which aims to engage the youngest festival attendees and educate them even more on current issues.",
        "paragraph4": "By bringing together locals from all walks of life, the festival lives up to its hype as a unifying factor for Filipinos in showing gratitude. The festive mood, the palpable joy as well as the warmth of the exuberant locals makes this a delightful festival to attend. Yes, it’s an incredibly fun festival, but there is so much more to it than just colors, music and games. The parade is a particularly memorable part of the festivals. The locals come out on their motorized floats, which are abundantly adorned with the best products the province has to offer. And with marching bands providing the music, it’s incredibly hard to just stand by and watch, and not join in the festivities. The wonderful thing about this festival is that it is not just about celebration and extreme sports. Raising awareness is also a very important part of festivals, be it about breast cancer or environmental changes. The 2019 edition of the festival also included a blood drive, which is without a doubt one of the best festival events to partake in. Attending the Tinagba Festival is sure to give you a glimpse into the life of the locals, as well as show you how the relation between traditional rituals has been interspersed with the religious practices of a modern Catholic community. It’s actually one of the greatest influences of Spanish Colonization. You would see different large and monumental churches and cathedrals such as Manila Cathedral, Paoay Church and so much more.",
        "imgItem1": "./img/fest-gallery/tinagba-img2.jpg",
        "imgItem2": "./img/fest-gallery/tinagba-img3.jpg",
        "imgItem3": "./img/fest-gallery/tinagba-img4.jpg",
        "imgItem4": "./img/fest-gallery/tinagba-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/BwJBVl4iluA",
        "ref": "https://expertworldtravel.com/philippines/tinagba-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftinagba-img1.jpg?alt=media&token=1da5c128-08cf-4467-be4d-be1d61d458db",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftinagba-img2.jpg?alt=media&token=4a3db062-95a6-473d-b937-8c609e2c2986",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftinagba-img3.jpg?alt=media&token=38850c13-f4de-4b01-832c-46893b137200",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftinagba-img4.jpg?alt=media&token=98c35ea1-e40b-4a0d-9610-c5ccc8c1fa53",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftinagba-img5.jpg?alt=media&token=400061fa-8ffe-486f-9f23-de4a455339c3"
    },
    {
        "title": "Bulawan Festival",
        "islandGroup": "mindanao",
        "date": "March 8",
        "dateFormat": "2022-03-08",
        "location": "Davao De Oro",
        "paragraph1": "The Bulawan Festival, an annual celebration of thanksgiving that also showcases ComVal’s culture and tradition and progress, took its name from gold mining. ComVal is located in Mindanao’s “Mineral Corridor” and its robust economy was partly propelled by mineral produce in barangay Mt. Diwata (Diwalwal) and other gold-rich barangays.",
        "paragraph2": "With its vast gold deposits, Davao Region’s Compostela Valley has gained the title “Golden Province.” But behind the minerals their mountains possess, the province is also home to different tribes practicing culture that share the same value as the bounty they hold.",
        "img": "./img/fest-gallery/bulawan-img1.jpg",
        "paragraph3": "To show gratitude to God who blessed them with such fortune, the province celebrates with its people through the Bulawan Festival. The festival, which is on its eighth year, is celebrated in the same week of its 20th Founding Anniversary on March 4-8.",
        "paragraph4": "Growing green for good governance is the theme for this year’s celebration, giving emphasis on initiating more programs for the environment despite the province’s continued development.",
        "imgItem1": "./img/fest-gallery/bulawan-img2.jpg",
        "imgItem2": "./img/fest-gallery/bulawan-img3.JPG",
        "imgItem3": "./img/fest-gallery/bulawan-img4.jpg",
        "imgItem4": "./img/fest-gallery/bulawan-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/z_TJD7uQKOQ",
        "ref": "http://www.traveltothephilippines.info/2019/11/05/bulawan-festival-is-the-festival-of-gold/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbulawan-img1.jpg?alt=media&token=14582b9f-df3d-4bd7-ba0c-52e9d16e8202",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbulawan-img2.jpg?alt=media&token=6cd31e40-a870-41ed-9bac-e8741d3723df",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbulawan-img3.JPG?alt=media&token=4ff72dde-bd8e-4c13-a916-37be8ee4079a",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbulawan-img4.jpg?alt=media&token=056cb525-1133-42e1-91ef-1f7e28187013",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbulawan-img5.jpg?alt=media&token=29422431-876c-4f1f-a976-16e851e1756d"
    },
    {
        "title": "Abaca Festival",
        "islandGroup": "luzon",
        "date": "May 24",
        "dateFormat": "2022-05-24",
        "location": "Virac, Catanduanes",
        "paragraph1": "The Abaca Festival or formally known as Catanduanes Abaka Festival is a festival held each year in Virac, Catanduanes, Philippines. The celebration happens every 4th week of the month of May.",
        "paragraph2": "The festival is cognizance of the importance of abaca fiber or Manila hemp industry in the local economy and the need to showcase its versatility as a major source of livelihood and craft material which has brought Catanduanes fame and fortune. The festival will showcase the life and resilient spirit of the Catandunganon and its culture, as well as the uniqueness and exoticness of the island and its people.",
        "img": "./img/fest-gallery/abaca-img1.jpg",
        "paragraph3": "Catanduanes Island is the native habitat of the endemic abaca plant (a banana relative) which is globally renowned for its strong fiber. In fact, the Philippines FIDA (Fiber Industry Development Authority) declared the island as the highest abaca producing province in 2010. In 2009-2013, The Philippine Rural Development Program (PRDP) and the Department of Agriculture, Bicol Region had 39% share of Philippine Abaca production, emerged as the biggest produce while overwhelming 92% comes from Catanduanes the biggest abaca producing province in the country. The island province is also home of the finest grade of abaca fiber.",
        "paragraph4": "Other key events in the five-day fest are competitions on Abaca Arch & Façade Entries, Festival Queen Competition, and Virtual Dance Showdown which will feature municipal contingents in abaca-inspired costumes interpreting local legends and folklore.",
        "imgItem1": "./img/fest-gallery/abaca-img1.jpg",
        "imgItem2": "./img/fest-gallery/abaca-img2.jpg",
        "imgItem3": "./img/fest-gallery/abaca-img3.jpg",
        "imgItem4": "./img/fest-gallery/abaca-img4.jpg",
        "ytPath": "https://www.youtube.com/embed/FEIjFega9Gg",
        "ref": "https://en.wikipedia.org/wiki/Abaca_Festival",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fabaca-img1.jpg?alt=media&token=151cd044-4106-4f49-8d90-b61abe3baab8",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fabaca-img2.jpg?alt=media&token=9160d8be-f383-4540-929d-cff54abfc8f2",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fabaca-img3.jpg?alt=media&token=98e0d889-a3c9-4999-946e-745f6ee1b6a4",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fabaca-img4.jpg?alt=media&token=f02601cc-73de-4b4c-8177-ba3abd024127",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fabaca-img5.jpg?alt=media&token=93579ba2-7b76-422a-aef2-ba0a927a5f94"
    },
    {
        "title": "Carabao Festival",
        "islandGroup": "luzon",
        "date": "May 14",
        "dateFormat": "2022-05-14",
        "location": "Pulilan, Bulacan",
        "paragraph1": "Carabao Festival is a unique festival held in the municipality of Pulilan, Bulacan every 14th of May. Even nearby provinces participate in this two-day celebration to join with the parade of beautifully decorated carts. According to Roman Catholic Church records, San Isidro was once hired as a labrador or laborer. On the farm where he worked, his landlord was astonished by his ability to finish his tasks despite coming late to work most of the time.",
        "paragraph2": "The townspeople celebrate the occasion in a hope for a year-long bountiful harvest. It is held with a two-day revelry where street dancing and a procession of decorated carabaos take place. A variety of multi-colored fruits, vegetables, flowers, candies, and other food crops are hung on bamboo poles and carts. These carts, pulled by the carabaos, serve as floats. The highlight of the fiesta is the genuflection or kneeling of the carabaos with its two front legs in front of the church as sign of reverence to Saint Isidore.",
        "img": "./img/fest-gallery/carabao-img1.jpg",
        "paragraph3": "On the first day, farmers pay tribute to carabaos. Farmers brush their carabaos' skin until it is sleek and shiny, while the horns are rubbed with oil and given shine. Then, the carabaos are decorated with ribbons or sometimes painted and attached to carts. In the afternoon, farmers lead their carabaos to the church square to be part of the procession. At the church, the carabaos not only kneel for their blessings but also walk on their knees like penitents in front of the church.",
        "paragraph4": "Aside from the kneeling of the carabaos and the carabao race, equally entertaining activities are done such as exhibitions where marching bands’ majorettes dance and twirl their batons, and children’s drum and lyre bands perform as street dancers take center stage with various folk dances.",
        "imgItem1": "./img/fest-gallery/carabao-img2.jpg",
        "imgItem2": "./img/fest-gallery/carabao-img3.jpg",
        "imgItem3": "./img/fest-gallery/carabao-img4.jpg",
        "imgItem4": "./img/fest-gallery/carabao-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/U0TGjEqplZA",
        "ref": "https://en.wikipilipinas.org/view/Carabao_Festival#Origin",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcarabao-img1.jpg?alt=media&token=7c603f83-c77a-4004-b0c5-270a70fdab37",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcarabao-img2.jpg?alt=media&token=d37a7213-aadc-4916-bfe6-88c004748fda",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcarabao-img3.jpg?alt=media&token=1ae164cb-2777-44a1-bb78-09dfc46b7661",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcarabao-img4.jpg?alt=media&token=2b25dd02-10da-40c0-be21-03a9d480319f",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcarabao-img5.jpg?alt=media&token=5dabaf2e-4568-44b6-a8c2-abd256d44a3d"
    },
    {
        "title": "Saulog Festival",
        "islandGroup": "visayas",
        "date": "April 22 - May 1",
        "dateFormat": "2022-04-22",
        "location": "Tagbilaran City, Bohol",
        "paragraph1": "The Saulog Festival in Tagbilaran City, Bohol is an annual cultural affair honoring St. Joseph the Worker.  The City Government of Tagbilaran, at the helm of the preparations of the significant celebration slated April 22 to May 1.",
        "paragraph2": "This thanksgiving festival got its inspiration from the local word, “saulog“, which means to celebrate or to commemorate. Now on its seventh year, it was bigger and brighter than ever.",
        "img": "./img/fest-gallery/saulog-img1.jpeg",
        "paragraph3": "Saulog Festival is one festivity that Boholanos look forward to every year. It does not only aim to merit the city’s most beloved patron, but also to show to the world that Tagbilaran City is fast growing, developing and progressing deserving a place on the global tourism map.",
        "paragraph4": "Saulog Festival is a surefire way of keeping the locals, as well as tourists, excited for the month-long fiesta season in the province of Bohol. Yet amid all the preparations for the festival, it’s interesting to note how devout the Tagbilaranons are to their patron saint, doing everything and anything they can to offer their thanks and love for St. Joseph the Worker.",
        "imgItem1": "./img/fest-gallery/saulog-img2.jpg",
        "imgItem2": "./img/fest-gallery/saulog-img3.JPG",
        "imgItem3": "./img/fest-gallery/saulog-img4.jpg",
        "imgItem4": "./img/fest-gallery/saulog-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/S7p_6dzv9NU",
        "ref": "https://www.driftstories.com/saulog-festival-tagbilaran-bohol/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsaulog-img1.jpeg?alt=media&token=d18e6eeb-45f1-4c83-ba30-ec8a7b32ef66",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsaulog-img2.jpg?alt=media&token=0fcbf19d-0c74-45ac-adfb-94443ac790d5",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsaulog-img3.JPG?alt=media&token=b6c9aeab-d9b8-46b2-a30d-43ac21eaea69",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsaulog-img4.jpg?alt=media&token=7507274c-c62e-4b31-bc73-0c0bb40a849a",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsaulog-img5.jpg?alt=media&token=1906c5a5-4262-45db-a646-3a5acf533d28"
    },
    {
        "title": "Sagayan Festival",
        "islandGroup": "mindanao",
        "date": "June 28 - July 2",
        "dateFormat": "2022-06-28",
        "location": "Lanao del Norte",
        "paragraph1": "The Sagayan Festival is held on Araw ng Lanao del Norte (Lanao del Norte Day). It was celebrated on June 28 - July 2.",
        "paragraph2": "A major event every July in the province of Lanao del Norte. A war dance of Maranao depicted in dramatic fashion steps of their hero, Prince Bantugan, took upon wearing his armaments, the war he fought in and his subsequent victory afterwards. Warriors would carry shield with shell noisemakers in one hand and double-bladed sword in the other attempting rolling movements to defend their master.",
        "img": "./img/fest-gallery/sagayan-img1.jpg",
        "paragraph3": "Datu Bantugan is the legendary hero of the Darangen, Maranao epic. His name connotes Brilliance, Fame, and Honor one who makes history, the pride of Bumbaran, Maramanay and Simban are among the several names attributed to Bantugan,which means Crown of the Ayonanâ.",
        "paragraph4": "",
        "imgItem1": "./img/fest-gallery/sagayan-img2.jpg",
        "imgItem2": "./img/fest-gallery/sagayan-img3.jpg",
        "imgItem3": "./img/fest-gallery/sagayan-img4.jpg",
        "imgItem4": "./img/fest-gallery/sagayan-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/neW5m4JVgNQ",
        "ref": "https://lanaodelnorte.gov.ph/sagayan-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsagayan-img1.jpg?alt=media&token=51f53ce0-4d18-4371-853c-96cd6cc129e2",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsagayan-img2.jpg?alt=media&token=bcf4db4e-059c-4546-8b31-f951d20058b7",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsagayan-img3.jpg?alt=media&token=58594760-9cf5-42a3-99bd-b090d044adb6",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsagayan-img4.jpg?alt=media&token=dd2c850e-0102-4232-b5de-f0c55d7ed45a",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsagayan-img5.jpg?alt=media&token=7e40457a-6eb2-4304-9a4b-58e9c57b6c8b"
    },
    {
        "title": "Pagoda Festival",
        "islandGroup": "luzon",
        "date": "July 3",
        "dateFormat": "2022-07-03",
        "location": "Bocaue, Bulacan",
        "paragraph1": "The Bocaue River Festival, also known as the Bocaue Pagoda Festival, is an annual religious celebration in Bocaue, Bulacan, Philippines. It is known for its river procession dedicated to the Roman Catholic relic, the Holy Cross of Wawa (Krus sa Wawa).",
        "paragraph2": "The Bocaue River Festival's devotion is connected to the Holy Cross of Wawa (Krus sa Wawa), a wooden item found flowing in the Wawa section of the Bocaue River during an onslaught of a typhoon in 1850. According to local legend, a drowning woman was saved after she clung to the cross – an event later characterized as a miracle. The cross later kept in a riverside church after its retrieval, is believed to have come from an old church which was razed in a fire. A fluvial parade has been held since then as a tribute to the relic.",
        "img": "./img/fest-gallery/pagoda-img1.jpg",
        "paragraph3": "The Bocaue Pagoda Festival has a cross which rides on top of a pagoda adorned with magnificent trimmings and guided by colorful bancas. Hundreds of people attend the procession for a nine-day novena, during which they feast and celebrate the legendary rescue of the Holy Cross from the Bocaue River. What is unique about the Bocaue Pagoda Festival festival however is the procession down the river with a huge ornately decorated pagoda float. The float is atop a barge and the river is the Pasig River. Thus is the Holy Cross of Bocaue brought down the river.",
        "paragraph4": "Today the Bocaue Pagoda Festival continues, part of it to remember the dead. This tradition will continue as usual with better order and safety. But for sure the Bocaue river festival will live on for a long long time.",
        "imgItem1": "./img/fest-gallery/pagoda-img2.png",
        "imgItem2": "./img/fest-gallery/pagoda-img3.jpg",
        "imgItem3": "./img/fest-gallery/pagoda-img4.jpg",
        "imgItem4": "./img/fest-gallery/pagoda-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/Yd3rn5FvEYE",
        "ref": "https://en.wikipedia.org/wiki/Bocaue_River_Festival",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpagoda-img1.jpg?alt=media&token=d80a2785-d220-4283-98fb-01281b9b38b2",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpagoda-img2.png?alt=media&token=68aedd54-8ed5-4af8-8102-6d9f6302bb3b",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpagoda-img3.jpg?alt=media&token=61b479c0-27ee-4e95-9b6a-af3a0ebc7e82",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpagoda-img4.jpg?alt=media&token=309b2026-a1a3-4e08-bc0f-e4ee35e1e2a7",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpagoda-img5.jpg?alt=media&token=6b9d7817-3f4d-42c6-9d48-990deb6b95d3"
    },
    {
        "title": "Sandugo Festival",
        "islandGroup": "visayas",
        "date": "July 1",
        "dateFormat": "2022-07-01",
        "location": "Tagbilaran City,Bohol",
        "paragraph1": "Annually, Bohol celebrates the “Sandugo Festival” in commemoration of the historical event which is the blood compact. The blood compact was done by Miguel Lopez de Legaspi (who was the leader of the Spain’s expedition) and Datu Sikatuna (a native Bohol leader). The blood compact they did signified the friendship they were to build among them.",
        "paragraph2": "Blood compact was a native ritual back then wherein each people participating will pour their blood in a cup, exchange cups with one another, and drink its contents. It was believed to happen on March 16, 1565 thus Boholanos celebrate the commemoration previously during the month of March but not as often as they are celebrating it nowadays. There were years as well that they completely forgot about it thus not celebrating it all together. Chatto Torralba (who was the provincial governor of Bohol from April 1975 to June 1992), saw the importance of the historical event therefore starting the “Sandugo Project” and anointing Mr. Loy M. Palapos as its chairman in order to give more attention to the annual celebration.",
        "img": "./img/fest-gallery/sandugo-img1.jpg",
        "paragraph3": "The initial celebration was successful even though there were just very limited time given to prepare for it and improvement could be seen in its subsequent celebrations. Government officials succeeded supported the project’s implementation and soon after, gained recognition not just provincial recognition or national but also international.",
        "paragraph4": "Initially, “Sandugo” was being celebrated on the month of March. Eventually, it was moved to July in accordance to the Tagbilaran Charter Day on the 1st and Bohol day on the 22nd of the month. Furthermore, it was said to be properly celebrated on that month as TBTK (Tigum Bol-anon Tibuok Kalibutan) is being celebrated during July as well wherein all Boholanos from all the parts of the world are gathered together in Tagbilaran City.",
        "imgItem1": "./img/fest-gallery/sandugo-img2.jpg",
        "imgItem2": "./img/fest-gallery/sandugo-img3.jpg",
        "imgItem3": "./img/fest-gallery/sandugo-img4.jpg",
        "imgItem4": "./img/fest-gallery/sandugo-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/xM8hjbWTlww",
        "ref": "https://www.bohol-philippines.com/sandugo-festival.html",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsandugo-img1.jpg?alt=media&token=5d6ac205-87eb-4559-a474-89ed571a9825",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsandugo-img2.jpg?alt=media&token=42a9ecaf-9652-41d5-aa9d-5aabecc4dd20",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsandugo-img3.jpg?alt=media&token=ac186906-40b2-4e4c-b065-5dbac0e2806f",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsandugo-img4.jpg?alt=media&token=9e8f0b77-6e87-46ef-91e9-961efbaea2a8",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsandugo-img5.jpg?alt=media&token=617955fb-6553-4977-b0ca-48d6da3eb43f"
    },
    {
        "title": "Coron Festival",
        "islandGroup": "luzon",
        "date": "August 13",
        "dateFormat": "2022-08-13",
        "location": "Tiwi, Albay, Bicol",
        "paragraph1": "“Coron” (also known as pottery) are products formed in a variety of shapes and sizes. This traditional industry is dated way back from the 17th century when the usefulness of the clay found in the hilly portions near the Bolo sea was discovered. This was figured out by the early settlers when they formed the clays into different shapes and sizes. They were able to use their product in cooking, drinking, and eating.",
        "paragraph2": "After some time, this product became the livelihood of the people transporting it to nearby towns and regions and taking advantage of the Coron products they are just using eventually giving birth to the Coron festival.",
        "img": "./img/fest-gallery/coron-img1.png",
        "paragraph3": "The festival’s highlight is the participation of both public and private schools and sectors from the town performing street presentations. All They prepare are sufficient for a week long celebration and entertainment for the locals and nonlocals alike.",
        "paragraph4": "The peek of the festival is the packaged devotion and prayer for Nuestra Señora de Salvacion (Our Lady of Salvation) which attracts many devotees and religious groups by a long procession participated by diverse local sea vessels heading to the home of the miraculous image being the Barangay Joroan.",
        "imgItem1": "./img/fest-gallery/coron-img2.jpg",
        "imgItem2": "./img/fest-gallery/coron-img3.jpg",
        "imgItem3": "./img/fest-gallery/coron-img4.jpg",
        "imgItem4": "./img/fest-gallery/coron-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/1jMv1CpZswo",
        "ref": "http://www.localphilippines.com/events/coron-festival",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcoron-img1.png?alt=media&token=708ae02c-7382-4ecc-bb17-19e73730d7f5",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcoron-img2.jpg?alt=media&token=67c88db8-ed44-4d7d-8cd3-138fa7603bb6",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcoron-img3.jpg?alt=media&token=f5ca6cc1-a963-44e5-bd85-be9da42b7488",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcoron-img4.jpg?alt=media&token=2f5d456e-b9bb-4336-9956-e5188fd54489",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcoron-img5.jpg?alt=media&token=482411ed-cbb8-4983-b163-b77c9e26f8ff"
    },
    {
        "title": "Higalaay Festival",
        "islandGroup": "mindanao",
        "date": "August 1",
        "dateFormat": "2022-08-01",
        "location": "Cagayan De Oro",
        "paragraph1": "The name “Higalaay” came from the Visayan word “Higala” having the meaning of friendship thus translating the name of the festival to “Friendship Festival”. The name was related to the tagline of the city itself which is “the city of golden friendship”. The original title of the celebration was “Cagayan Festival” until the city government was changed on 2014.",
        "paragraph2": "August 28, 1728 was the date when the St. Augustine cathedral Church (being the first Christian church in the city) was finished. From that day on, the 28th of August was considered as the feast day of Cagayan De Oro.",
        "img": "./img/fest-gallery/higalaay-img1.jpg",
        "paragraph3": "The festival begins on the 1st week of August commemorating the feast day of the city patron St. Augustine lasting until the end of the month. The Kumbira Food Fair and Festival kicks off on August 17-19 at the Atrium of the Limketkai Mall. Since 1996 the Kumbira Festival, a brainchild of the city’s COHARA organization, has highlighted the city’s chefs, local culinary arts, competitions, and culinary schools on a global scale.",
        "paragraph4": "Other traditional core events for the city fiesta include the annual Rodeo and Cowboy Festival now held beside the SM City Mall starting August 20, the Kagayan Festival Marathon (August 20), the Carnival Parade in Divisoria (August 20), the Higalas Parade of Floats and Icons (August 27), Religious Procession at St. Augustine Cathedral and the Fluvial Procession along the Cagayan River (August 28), and the city-wide sales from all the malls and major stores.Adding to the modern fiesta tradition is the Fireworks Display held every year on the nights of August 27 and 28 at the SM City Mall and Duaw Park respectively.",
        "imgItem1": "./img/fest-gallery/higalaay-img2.jpg",
        "imgItem2": "./img/fest-gallery/higalaay-img3.jfif",
        "imgItem3": "./img/fest-gallery/higalaay-img4.jpg",
        "imgItem4": "./img/fest-gallery/higalaay-img5.JPG",
        "ytPath": "https://www.youtube.com/embed/gsX3SKa_Mow",
        "ref": "https://aboutcagayandeoro.com/higalaay-festival-essence-true-friendship-faith/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhigalaay-img1.jpg?alt=media&token=6bff44c4-a5b1-4794-bb98-bb1b00b45854",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhigalaay-img2.jpg?alt=media&token=3508b54b-6420-4316-b364-6650257cc35f",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhigalaay-img3.jfif?alt=media&token=1bd69c59-06fd-4b35-b4ba-f5202fc8780a",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhigalaay-img4.jpg?alt=media&token=b83f709a-6544-4e1f-af2a-52bf99258b87",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhigalaay-img5.JPG?alt=media&token=725eea99-c9a5-4549-9b66-06744f292304"
    },
    {
        "title": "Ibalong Festival",
        "islandGroup": "luzon",
        "date": "October 25 - 31",
        "dateFormat": "2022-10-25",
        "location": "Legaspi, Albay",
        "paragraph1": "The “Ibalong Festival” is being celebrated every year from the 25th to the 31st of October in the city of Legaspi in Albay. Its name was derived from the popular epic legend from the city concerning its precolonial history.",
        "paragraph2": "This feast is unique in its own way. Different from many feasts in the country that are based in religious aspect or harvest, this festivity originates from the Ibalong epic wherein the heroes Baltog, Handyong, and Bantong who were residing in Ibalon fought bravely against the monsters within the town. It is also believed from the epic that they saved Ibalon from a great flood and arranged the laws for the land. This feast is unique in its own way. Different from many feasts in the country that are based in religious aspect or harvest, this festivity originates from the Ibalong epic wherein the heroes Baltog, Handyong, and Bantong who were residing in Ibalon fought bravely against the monsters within the town. It is also believed from the epic that they saved Ibalon from a great flood and arranged the laws for the land.",
        "img": "./img/fest-gallery/ibalong-img1.jpg",
        "paragraph3": "The epic itself was believed to consist 400 stanzas constructed in three parts originally but only has 60 at current. A Franciscan missionary named Padre Jose Castano was known to be the transcriber of Ibalon The epic ends in the part where Bantong killed a half man half beast creature.",
        "paragraph4": "Despite of many parts missing from the story, the locals are holding the celebration as a symbol of resiliency and bravery as well for the city of Legaspi is often being hit by typhoons. People from other places are welcome to visit and join the feast to feel the hospitality of Bicolanos. The main attraction of the event is the synchronized dance parades in the streets with the Mayon Volcano in the background which has the perfect cone shape.",
        "imgItem1": "./img/fest-gallery/ibalong-img2.jpg",
        "imgItem2": "./img/fest-gallery/ibalong-img3.jpg",
        "imgItem3": "./img/fest-gallery/ibalong-img4.jpg",
        "imgItem4": "./img/fest-gallery/ibalong-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/CCUE991QKKQ",
        "ref": "https://expertworldtravel.com/philippines/ibalong-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fibalong-img1.jpg?alt=media&token=f33fddc6-1c97-4ba0-b875-7f8d773eadaa",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fibalong-img2.jpg?alt=media&token=fe423dbf-9567-4c6f-ae80-a7cc37930978",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fibalong-img3.jpg?alt=media&token=76095171-ab14-40fb-b4a4-6c1c4cf51710",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fibalong-img4.jpg?alt=media&token=0f551566-a94f-4829-b804-58716cd2a1c2",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fibalong-img5.jpg?alt=media&token=fa2ca287-cafd-4cd7-aebd-aaa1e4e3f3d3"
    },
    {
        "title": "Diyandi Festival",
        "islandGroup": "mindanao",
        "date": "September 29",
        "dateFormat": "2022-09-29",
        "location": "Iligan City",
        "paragraph1": "The town of Iligan consists of Muslim, Christian, Maranao, and Lumad citizens and each group has their own culture making the town very diverse. In the contrary, all of them have a faithful belief in their patron Señor San Miguel. Their belief came from each culture’s religious doctrines telling the divine protection given by Señor San Miguel to the ancestral residence of the town against floods and attacks. Muslims however has “mala’ikah” as their Muslim counterpart of the patron who is the patron of chivalry or the spiritual being who obeys Allah’s commands according to the Qur’an.",
        "paragraph2": "The Diyandi Festival’s celebration matches to the global feast of St. Michael the Archangel. It starts with a performance from women inspiring Diyandi Festival. Two rows of Iliganon women impersonate male Maranaos and Higaunon females devoting prayers to San Miguel. The performance is being done when the image of Señor San Miguel is being brought down from its base to the altar’s side called “pagkanaug” also starting the nine-day morning novena known as “pamukaw”. Finally, the whole celebration ends in the ascension of the patron back to his pedestal and it is called as “pagsaka”.",
        "img": "./img/fest-gallery/diyandi-img1.jpg",
        "paragraph3": "“Eskrima” is the street dancing competition between different barangays or even cities/municipalities competing for a hefty prize given by the city local government as part of the traditional celebration of the diyandi Festival. In that street dancing, they reenact the battle in heaven in the form of dance choreography called “Comedia de San Miguel” in street dancing (eskrima).",
        "paragraph4": "A lot of members are formed dancing with their costumes and props around the dance actors who plays as Lucifer and another as St. Michael the archangel. Loud musical score and orchestra instruments will be played along with those street dancers (trumpets, gong, drums, bamboo drums, xylophones, and others) In that play, they would swing their weapons (sword for Michael and giant fork-like spear for Lucifer) until eventually Michael would slice and stab Lucifer making him fall to the ground. Then, the last iconic act of that “Comedia de San Miguel” will be St. Michael stepping over the body of Lucifer pinning him down and aiming his sword at the devil piercing him downwards. Afterwards, the group including those actors would stand up again dancing their way ahead to another group of judges situated in different corners of the city reenacting the same sequences until the final presentation is usually being held in the city hall's huge amphitheater.",
        "imgItem1": "./img/fest-gallery/diyandi-img2.jpg",
        "imgItem2": "./img/fest-gallery/diyandi-img3.jpg",
        "imgItem3": "./img/fest-gallery/diyandi-img4.jpg",
        "imgItem4": "./img/fest-gallery/diyandi-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/vZtkE7dnCtc",
        "ref": "http://www.traveltrilogy.com/2018/10/diyandi-festival-iligan-city.html",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fdiyandi-img1.jpg?alt=media&token=fc87f16f-b6de-451b-986d-a0c23b19b45d",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fdiyandi-img2.jpg?alt=media&token=00da2440-e4ed-4dce-ab92-296a1ec29844",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fdiyandi-img3.jpg?alt=media&token=8d2200d9-16aa-40e9-9fa3-3535b6b13703",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fdiyandi-img4.jpg?alt=media&token=d5913ce0-fcef-4949-9def-47873d2ddaa9",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fdiyandi-img5.jpg?alt=media&token=901705b7-9842-46bd-93ea-25ff082274d6"
    },
    {
        "title": "Aliwan Festival",
        "islandGroup": "luzon",
        "date": "April 25-27",
        "dateFormat": "2022-04-25",
        "location": "Pasay City",
        "paragraph1": "Aliwan Festival is one of the most popular festivals in the Philippines. It attracts tourists in their numbers from across the country and the globe. It is an annual event just like most of the other Philippines festivals, and it is all about celebrating the diverse culture of the locals. The Fiesta brings together multiple festivals to gather in Pasay City. Due to the sheer magnitude of the fiesta, the city throngs with culture enthusiasts and other travelers. The fiesta not only brings together large numbers of tourists, but it is also an adventure of sorts if the competitions and prize money are anything to go by. It gathers people from all different regions of the country, and it is sort of like a combination of all of the regions’ respective festivals if that makes sense.",
        "paragraph2": "The aim of the Aliwan Festival is to promote the different cultures of the country, not just to its own people, but to tell the story to the rest of the world. And considering just how much the popularity of the Fiesta is increasing each year, it’s safe to say that it’s doing a great job at that.",
        "img": "./img/fest-gallery/aliwan-img1.jpg",
        "paragraph3": "One of the equally visually exciting segment of the festival is Reyna ng Aliwan. The Beauty Pageant gathers some of the most stunning Filipino women from the country, that compete for the title of the most beautiful one. And, the pageant contestants are actually standing on top of the floats of their region, as they are the muses and inspiration behind the designs. With so many stunning women, the task in front of the judges is an incredibly difficult one. Reyna ng Aliwan actually serves as a great training ground for women who aim to be pageant contestants, and many of them go on to win multiple other beauty contests.",
        "paragraph4": "There are several other side activities one can partake in during the festivities. The Fiesta boasts a vast bazaar, where you can buy all sorts of items from the different regions of the country. There’s also a fireworks display, which is entertaining for all festival-goers. And if you’re feeling the spirit of the competition, you can take part in the photography contest, or try your hand in some of the many Filipino street games.",
        "imgItem1": "./img/fest-gallery/aliwan-img2.jpg",
        "imgItem2": "./img/fest-gallery/aliwan-img3.jpg",
        "imgItem3": "./img/fest-gallery/aliwan-img4.jpg",
        "imgItem4": "./img/fest-gallery/aliwan-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/utYdNlBE9v8",
        "ref": "https://expertworldtravel.com/philippines/aliwan-fiesta/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Faliwan-img1.jpg?alt=media&token=7ef6d1f0-0320-4c0d-9bb7-aeab42bbf428",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Faliwan-img2.jpg?alt=media&token=597717a6-89f3-46d5-938b-0e5133973e72",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Faliwan-img3.jpg?alt=media&token=a2ad68e3-80e1-4354-844e-9e2e254c7980",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Faliwan-img4.jpg?alt=media&token=84b41e74-47d3-48fe-a588-1f72e54fdc35",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Faliwan-img5.jpg?alt=media&token=58a42422-0bbf-4d65-b65d-f1495e54c30d"
    },
    {
        "title": "T’Nalak Festival",
        "islandGroup": "mindanao",
        "date": "July 10",
        "dateFormat": "2022-07-10",
        "location": "Koronadal City, South Cotabato",
        "paragraph1": "T’Nalak Festival stands out among the many festivals held in the Philippines. It is a way to promote and maintain South Cotabato's cultural heritage, not only because it is a colorful event (as are most Philippine festivals), but also because it is a way to promote and preserve South Cotabato's cultural heritage. T'nalak is a traditional textile created by the T'boli tribe of Mindanao Island. The festival motif is claimed to be chosen because it symbolizes the merging of culture, strength, and unity. The cloth is mostly red, black, and the color of the Abaca leaves, which is a dark verdant green. The festival, which takes place in mid-July as part of the commemorations for the province's founding anniversary, includes a civic parade with colorful floats and street dancing.",
        "paragraph2": "Cotabato's image as a location of sunshine and all things lovely hasn't always been the case because the province has long been associated with conflicts, making people fearful of visiting it. However, in 1989, the villagers found a way to celebrate by attracting a large number of tourists to the area. It was in this year that the late Lang Dulay, a Lake Sebu resident and well-known dreamweaver, was honored as a National Living Treasure for her work as a T'nalak weaver. Tnalak Festival was formed as a result of this awarding ceremony. As a result, this festival has two basic goals: the first is to commemorate the province's creation anniversary, and the second is to highlight T'nalak's rich cultural legacy.",
        "img": "./img/fest-gallery/tnalak-img1.jpg",
        "paragraph3": "Just like in most festivals around the country, the T’nalak festival is loaded with events that cater to various types of visitors. More activities organised for the T'nalak festivities include cultural shows an agri-trade fair, bazaars, visits to various tourism attractions in the province. Concerts by local and national performers and a breath-taking fireworks display competition. with plenty in store to keep visitors entertained.",
        "paragraph4": "The City of Koronadal is the capital city of South Cotabato province and is also known by the name of Marbel. In this town many traces of the province's history are still present,. The people of Koronadal can be described as warm-hearted and friendly. A community that is willing to accept people from all backgrounds and origins. The people of Koronadal will welcome their visitors with a smile and are famous for their unique hospitality.",
        "imgItem1": "./img/fest-gallery/tnalak-img2.jpg",
        "imgItem2": "./img/fest-gallery/tnalak-img3.jpeg",
        "imgItem3": "./img/fest-gallery/tnalak-img4.jpg",
        "imgItem4": "./img/fest-gallery/tnalak-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/AuJ3YCRXpGw",
        "ref": "https://www.zenrooms.com/blog/post/tnalak-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftnalak-img1.jpg?alt=media&token=1ee57934-722f-4c31-a0bf-227fb5fd48b5",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftnalak-img2.jpg?alt=media&token=d4a9b5cb-f69a-4bbb-95b1-ffea8a9ac378",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftnalak-img3.jpeg?alt=media&token=cce2b57d-9460-45c8-99a2-306d5a131702",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftnalak-img4.jpg?alt=media&token=e11fb39c-7117-4e0e-9d3f-6a8f25825082",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftnalak-img5.jpg?alt=media&token=0865413d-b6e9-4988-8789-3c756756137f"
    },
    {
        "title": "Pintados Festival",
        "islandGroup": "mindanao",
        "date": "June 29",
        "dateFormat": "2022-06-29",
        "location": "Tacloban City",
        "paragraph1": "The Pintados Festival is a cultural religious festival held in Tacloban in honor of the old inked pintados soldiers' body-painting rituals. The Pintados Foundation, Inc. was founded in 1986 by the people of Tacloban to organize this celebration in honor of Sr. Santo Nino. The festival, officially known as the Leyte Pintados-Kasadyaan Festival and also known as the Celebration of Festivals, takes place every year on June 29, the Feast of the Senor Santo Nino de Leyte. The most courageous warriors were vigorously decorated in tattoos which secured every last bit of their bodies, go to foot. Without a doubt, these men were in truth such an abnormal sight, to the point that western teachers thought of them as startling and ignoble upon their first looks of these warriors.",
        "paragraph2": "Be that as it may, as time passed, they figured out how to see the tattoos as a piece of the life of local individuals and even as an indication of magnificence for them. With the progression of time, as the story is with all things, the old cleared a path for the new.",
        "img": "./img/fest-gallery/pintados-img1.jpg",
        "paragraph3": "This Pintados event invites us to recognize the importance and excellence of the nation's forefathers' customs. It provides us with the opportunity to engage in a rare firsthand experience of culture. As time passed, the customs of inking pintados and worshiping ground spirits were phased out. These customs, however, are still remembered with the celebration of the Pintados festival. Before tattoos became mainstream, native Filipinos were already into this form of body art including those from Leyte. Back in the days, getting a tattoo was painful and unsafe so those who went through that danger were considered brave and strong. The Pintados Festival is a showcase of the cultural heritage of Leyte and Samar.",
        "paragraph4": "The Pintados-Kasadyaan festival includes multiple events throughout the celebration. These events are called the Festival of festivals of Leyte, the Ritual Dance Presentation of Pintados Festival, and the “Pagrayhay” during the Grand Parade. Dancers paint their bodies in patterns that resemble armor to represent past warriors.",
        "imgItem1": "./img/fest-gallery/pintados-img2.jpg",
        "imgItem2": "./img/fest-gallery/pintados-img3.jpg",
        "imgItem3": "./img/fest-gallery/pintados-img4.jpg",
        "imgItem4": "./img/fest-gallery/pintados-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/0h_70k-u-x0",
        "ref": "https://www.hellotravel.com/events/pintados-festival",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpintados-img1.jpg?alt=media&token=63b4c906-5d26-4045-9a51-1c426429d372",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpintados-img2.jpg?alt=media&token=bf8d4bee-48af-4ebf-9eb4-75397bfe9e96",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpintados-img2.jpg?alt=media&token=bf8d4bee-48af-4ebf-9eb4-75397bfe9e96",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpintados-img3.jpg?alt=media&token=4fc0d27c-1188-43ea-a24a-2ba8e41d9a77",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fpintados-img5.jpg?alt=media&token=30f89b2e-bff6-4737-8dcd-7b20fa4f19f1"
    },
    {
        "title": "Kaamulan Festival",
        "islandGroup": "mindanao",
        "date": "February 20 - March 10",
        "dateFormat": "2022-02-20",
        "location": "Malaybalay City, Bukidnon",
        "paragraph1": "The Kaamulan Festival combines a thanksgiving ritual, a tribal peace treaty, a datukship ritual, and a wedding ceremony into one. This festival is a genuine ethnic gathering that celebrates the diversity of tribes and their traditions. Bukidnon, Talaandig, Tigwahanon, Manobo, Umayamnon, Matigsalog, and Higaonon are among the seven ethnic Filipino tribes who would be present. It comes from the term 'amul,' which means 'to gather.' Tribes come together to show off their traditional clothes, dances, and wares. It is a beautiful festival to witness. They also have various traditions and rituals like Pag Ampo (general worship), the Tagulambong hu Datu (ritual for the installation of a Chieftain), the Panumanod (a spiriting ceremony), the Panli Sig (rite to drive away evil spirits), and the Pamalas (sin atonement ritual).",
        "paragraph2": "On May 15, 1974, at the fiesta celebration of the then municipality of Malaybalay, Kaamulan began as a festival. To liven up the fiesta celebration, a town official invited some indigenous people to town and had them perform a few dance routines at Plaza Rizal. The celebration, however, was well-received, and the Kaamulan festival has since been designated as the regional festival of Northern Mindanao by the Regional Development Council of Region 10 on September 16, 1977. Kaamulan was previously held in the first week of September, but in 1996 it was changed to the current date to coincide with the province's centennial celebrations, until it was relocated again in 2014 to the month of August in honor of Bukidnon's 100th founding anniversary. The festival was mentioned as having a high chance of being added to the UNESCO Intangible Cultural Heritage Lists.",
        "img": "./img/fest-gallery/kaamulan-img1.jpg",
        "paragraph3": "Graced by cultural groups whose ways have remained unchanged throughout the centuries, the Kaamulan is characterized by the authentic rituals with real indigenous peoples. There is the Pangampo (general worship), the Tagulambong hu Datu (ritual for the installation of a Chieftain), the Panumanod (a spiriting ceremony), the Panlisig (rite to drive away evil spirits), and the Pamalas (sin atonement ritual) among others. Each activity is a meaningful ceremony that reflects the richness and diversity of the Bukidnon culture. Integrated into the festival are activities designed to fuse the different sectors in the provincial community as a whole. The events which have been institutionalized over the years of celebrating the Kaamulan include the Civic Parade; the much-awaited Street-dancing Competition with contingents coming from the respective municipalities and cities of the province; the Laga Ta Bukidnon where beautiful ladies from within the province vie for the title; programs reminiscent of the historic beginnings of Bukidnon and its tribal oral traditions; and, the Ethnic Dance Clinic.",
        "paragraph4": "Furthermore, the present Kaamulan has evolved throughout the years and does not only highlight Bukidnon’s ethnic groups but also the products and local establishments that abound in the province. These are displayed in the Garden Show, Food Fest, Kaamulan Bazaar, Agri-fair, and Livestock Show. Crowd-drawing events such as the Motocross, Off-road Competition, Rodeo, Amateur Boxing, Invitational Basketball Tournament, Adventure Races, concerts, and several others are also roped into the festivity.",
        "imgItem1": "./img/fest-gallery/kaamulan-img2.jpg",
        "imgItem2": "./img/fest-gallery/kaamulan-img3.jpg",
        "imgItem3": "./img/fest-gallery/kaamulan-img4.jpg",
        "imgItem4": "./img/fest-gallery/kaamulan-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/-ksXBYhW7mc",
        "ref": "https://bukidnon.gov.ph/2012/11/20/kaamulan-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkaamulan-img1.jpg?alt=media&token=65011dd5-04d4-4895-a378-b97860ec3115",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkaamulan-img2.jpg?alt=media&token=dfc3c4f0-c0bf-4362-9a07-9780bf3d7e75",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkaamulan-img3.jpg?alt=media&token=ca973035-5f59-4b46-9045-d14c3258715e",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkaamulan-img4.jpg?alt=media&token=5f50cc15-abf6-4b24-97a0-18d136d3a0f1",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkaamulan-img5.jpg?alt=media&token=95213405-8c39-4324-8e42-4dd1d22fc992"
    },
    {
        "title": "Zamboanga Hermosa Festival",
        "islandGroup": "mindanao",
        "date": "October 1",
        "dateFormat": "2022-10-01",
        "location": "Zamboanga City",
        "paragraph1": "Zamboanga is a heavily populated city in the Philippines' southern region. It now serves as the commercial and industrial hub of the Zamboanga Peninsula Region. Because of its Spanish-tinged Chavacano dialect, the city is also known as Asia's Latin City. Despite the city's growth and modernisation, one positive aspect of Zamboanga is that its customs and traditions have been preserved over time and are still alive today. The Hermosa Festival, the city's largest yearly celebration and commemoration, is proof of this. The Zamboanga Hermosa Festival, also known as Fiesta Pilar, is an annual event honoring the city of Zamboanga's patroness, Our Lady of the Pillar. The Zamboangueos are noted for their ardent devotion to Our Lady of the Pillar, also known as Nuestra Seora La Virgen del Pilar among them.",
        "paragraph2": "This is due to the miracles that Our Lady is thought to have done. The major element of the Real Fuerza de Seora Virgen del Pilar, a fort-turned-shrine dedicated to Her, is Her image. On her feast day, October 12, people gather to pay their respects. Festivities last the whole month of October. The highlights would include a nine-day novena, fashion shows, dance and song competitions, trade fairs, a pageant, and the famous Regatta which is a race of colorful vintas.",
        "img": "./img/fest-gallery/hermosa-img1.jpg",
        "paragraph3": "The Zamboanga Hermosa Festival is one of the city's and region's greatest and most anticipated events. This exemplifies Zamboanga City's beauty—its rich and diversified culture and tradition. It is, without a doubt, a sight to behold. These events are organized by the City Government with the help of some private companies for the entire month. Each event is of great significance since their motifs are some of the city's prized treasures; the reflection of the city's rich culture. The celebration showcases the colorful and magical side of the city. It also features the city's diverse traditions and beliefs. Given that the festival is celebrated in honor of the city's patron saint, the locals; as well as the tourists from other parts of the country and abroad also observe religious activities. Indeed, Zamboanga has proved itself worthy of being called Orgullo de Mindanao or the Pride of Mindanao. Through this festival, the city is able to show the world what it has up its sleeves.",
        "paragraph4": "The Regatta is one of the many events offered at the Hermosa Festival. It's a vibrant boat race that showcases the city's vibrant vintas. Mascota de Zamboanga, WOW Sardinas, Cosechas de Zamboanga, Miss Zamboanga, Baile de Festival, Balikbayan Night, Dia de Culturas y Artes, Battle of the Band, Copa de Alcalde, Fiesta Sale, Musica de Chabacano, Danza la Vida, Pink October, and Servicio Medical na Fiesta Pilar are some of the other annual activities held during this festival",
        "imgItem1": "./img/fest-gallery/hermosa-img2.jpg",
        "imgItem2": "./img/fest-gallery/hermosa-img3.jpg",
        "imgItem3": "./img/fest-gallery/hermosa-img4.jpg",
        "imgItem4": "./img/fest-gallery/hermosa-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/aP-by-J5yUg",
        "ref": "https://philippines.travel/events/zamboanga-hermosa-festival",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhermosa-img1.jpg?alt=media&token=4dbeee97-eccc-4711-a7e4-3335237be166",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhermosa-img2.jpg?alt=media&token=73ba12be-2746-4823-a1a1-1130bd503959",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhermosa-img3.jpg?alt=media&token=d771720d-3cdc-4537-92ed-25eeccb1f142",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhermosa-img4.jpg?alt=media&token=6f612504-f0b9-4c94-ab99-2778ab45c112",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhermosa-img5.jpg?alt=media&token=1924b8b1-9f90-49a6-b1ce-fa0f0de29ab7"
    },
    {
        "title": "Coco Festival",
        "islandGroup": "luzon",
        "date": "January 2",
        "dateFormat": "2022-01-02",
        "location": "San Pablo, Laguna",
        "paragraph1": "The Coconut Festival is a week-long celebration in honor of Paul the Hermit, the patron saint. The festival began in 1996 with the goal of promoting the city and its principal product, the coconut. The Mardi gras, the event's climax, is frequently attended by students and remarkable groups dressed in attractive garbs created from coconut tree pieces while dancing to local indigenous music. he festival consists of Street dancing, float parade, street concerts, nightly programs before the city fiesta and some other important events like the yearly Mutya at Lakan ng San Pablo.",
        "paragraph2": "It draws residents from different towns as well as foreign visitors, as well as local and national media. This benefits San Pablenos' culture and traditions. The festival was also named the best tourism event for Festival Category City Level for Calendar Year 2010-2011-2012-2013 (PIA) by the Association of Tourism Officers of the Philippines (ATOP) and the Department of Tourism (DOT), establishing San Pablo City as a tourist destination. During the 14th National Convention of the Department of Tourism (DOT)–Association of Tourism Officers of the Philippines (ATOP) held in Legazpi City, Albay, the city's Coconut Festival received the Pearl Award as Hall of Famer in 2013.",
        "img": "./img/fest-gallery/coco-img1.jpg",
        "paragraph3": "The City of Seven Lakes is how San Pablo, Laguna is called. There are seven lakes in this city to the south of Manila, which is exactly what it sounds like. Locals and tourists alike flock to San Pablo to see the lakes and swim or picnic. This small city, however, hosts one of the country's greatest festivities, the Coconut Festival, at the start of each year. Coconut production is one of Laguna’s main industries. From the actual fruit to the many products derived from it, Laguna’s economy gets a boost due to the many plantations in the province.",
        "paragraph4": "The one-week festival is a must-attend, especially for nature lovers who are inspired by the outdoors. At the beginning of the Coconut Festival, look out for the dancing close to the statue of the saint. The night sessions are also an exciting part of the festival. The Coco Float Parade put San Pablo city on the map. Different groups and towns gather to show off their creations. But the strongest draw of the parade is the street dancers, which is also a competition. It’s divided into elementary, high school, and college divisions where students from Laguna participate for a prize.",
        "imgItem1": "./img/fest-gallery/coco-img2.jpg",
        "imgItem2": "./img/fest-gallery/coco-img3.jpg",
        "imgItem3": "./img/fest-gallery/coco-img4.jpg",
        "imgItem4": "./img/fest-gallery/coco-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/JQ5GQl4uDrs",
        "ref": "https://expertworldtravel.com/philippines/coconut-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcoco-img1.jpg?alt=media&token=e4abbd7c-4c2d-4f00-b7a8-9bc6c18ced92",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcoco-img2.jpg?alt=media&token=e7345fc2-0789-4ce8-aa6e-b5f630e34aad",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcoco-img3.jpg?alt=media&token=b671cae6-b35e-47b6-8d0f-f3b703ac7aae",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcoco-img4.jpg?alt=media&token=7513bdb9-e584-4326-9bf8-acbe87afec2d",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fcoco-img5.jpg?alt=media&token=c147c6dc-82b5-47f2-a220-0e1ea51f2a5c"
    },
    {
        "title": "Bambanti Festival",
        "islandGroup": "luzon",
        "date": "January 22",
        "dateFormat": "2022-01-22",
        "location": "Isabela",
        "paragraph1": "The provincial government, led by Governor Rodito T. Albano III and Vice Governor Faustino G. Dy III, organized Bambanti, which means scarecrow in Ilocano. The celebration, which began in 1997, honors all local farmers who endure and are committed to producing rice and corn in spreading green fields in order to provide a living for their family and food for the community. A bambanti village is set up to house all the activities during the festival to include agri-ecotourism exhibits, bambanti installations, Isabela Singing Idol and Glee, festival street dance competition with Festival King and Queen, and a grand fireworks display.",
        "paragraph2": "All municipalities and cities (excluding Santiago City) participated in the Bambanti Village: Agri-Ecotourism Exhibit and Sale, presenting several meticulously made Giant Bambanti and Agri-Ecotourism Booths that sell the best agricultural products and items originally from their hometowns. The town of Jones won the bacon in category A for Giant Bambanti, while Quirino won the bacon in category B. The municipality of Alicia shone out among all competitors in category A for Agri-Ecotourism Booth, while Burgos won category B.",
        "img": "./img/fest-gallery/bambanti-img1.JPG",
        "paragraph3": "Bambanti Festival last 2020 is not a typical celebration. It is a celebration with a cause. Due to the eruption of Taal Volcano , the organizers came up with an idea, iRUNFORTAAL: Color Fun Run, to raise funds for the victims. The preparation for this event was done in only five days; however, 12,000 runners participated and more than 1 million pesos were raised. All proceeds will be donated to affected areas of Batangas and Cavite.",
        "paragraph4": "Locals and visitors flocked to Isabela Sports Complex's stadium to watch 2700 dancers from 27 municipalities dress up as scarecrows, execute routines, and dance to the beat of music while chanting Bam-ban-ti! With their performance spelling out the letters A-L-I-C-I-A using their bodies, the town of Alicia took home the top medal in category A, beating out 11 other contingents.",
        "imgItem1": "./img/fest-gallery/bambanti-img2.jpg",
        "imgItem2": "./img/fest-gallery/bambanti-img3.jpg",
        "imgItem3": "./img/fest-gallery/bambanti-img4.jpg",
        "imgItem4": "./img/fest-gallery/bambanti-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/Ysff-c5j8hQ",
        "ref": "https://thejerny.com/travel/isabela-celebrates-bambanti-festival-2020/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbambanti-img1.JPG?alt=media&token=41a91f04-19ec-4b0a-a957-fe9ddf3be794",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbambanti-img2.jpg?alt=media&token=c1bdb5af-5b97-4e59-b835-bb7f56c4c177",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbambanti-img3.jpg?alt=media&token=5f36246f-83a2-4243-8679-0acfd6403249",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbambanti-img4.jpg?alt=media&token=0f4bdd56-5bd7-4266-be63-966b70a70371",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbambanti-img5.jpg?alt=media&token=230bdfe4-1eea-4be3-b570-b6ac40d1ac69"
    },
    {
        "title": "Helobung Festival",
        "islandGroup": "mindanao",
        "date": "November 8-11",
        "dateFormat": "2022-11-08",
        "location": "Lake Sebu, South Cotabato",
        "paragraph1": "The Tboli culture is celebrated at the Helobung Festival. It is also commemorated to mark the creation of the picturesque town of South Cotabato in Mindanao, which is situated more than 700 meters above sea level. It is said that this is the busiest time of year in the town. The celebration allows geometric ethnic artwork in bright red and deep black colors to be painted on the streets, representing the indigenous Tboli culture. The colors red and black indicate bravery and love, while black signifies the earth, the source of life.",
        "paragraph2": "The T'boli tribe holds a celebration of their arts, culture, and athletics every November. A traditional horse fight is staged on the day of the festivities. Helubong is a T'boli word that means never-ending happiness. During the celebration, beadworks, baskets, and other woven crafts created from the abaca handicraft known as T'nalak are on show. The T'boli men and women can even be seen weaving and wearing the T'nalak fabric as they congregate for the event. One of the numerous highlights of the event is a dance to traditional music accompanied by the tribe's musical instruments. One method to reconnect with our heritage is to attend the Helubong Festival.",
        "img": "./img/fest-gallery/hebolung-img1.jpg",
        "paragraph3": "The one week celebration showcases the life, history and stories of the Tboli peoples through the activities and competitions among local contestants. There's bangka (dugout canoe) racing to showcase the traditional means of transportation Tbolis use to travel from islets of Lake Sebu to the main land. Lake Sebu is surrounded by large bodies of water, which provide abundant tilapia, among other fish, to the locals. The Helobung Festival (never-ending joy in T'boli) is a festival of thankfulness for abundant benefits. The T'boli cloth, T'nalak abaca handicraft, traditional music and instruments, and the many delicacies, which include various ways of presenting the local's fresh tilapia, are all highlighted during this culture-rich festival.",
        "paragraph4": "The festival also gives the Tboli the chance to present their culinary pride. Tboli foods and menus are mostly from root crop staples but the most interesting are the ones made with our amphibian friends: the stewed frogs and the char grilled frogs. The traditional foods are showcased in cottages assigned for the 19 barangays and everyone is invited to partake for no cost",
        "imgItem1": "./img/fest-gallery/hebolung-img2.jpg",
        "imgItem2": "./img/fest-gallery/hebolung-img3.jpg",
        "imgItem3": "./img/fest-gallery/hebolung-img4.jpg",
        "imgItem4": "./img/fest-gallery/hebolung-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/P7GMuhDaUc4",
        "ref": "http://www.traveltothephilippines.info/2019/10/23/helobung-festival-celebrates-tboli-culture-of-never-ending-joy/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhebolung-img1.jpg?alt=media&token=a0ac6be7-a5f0-44cb-b8a9-5614586f3658",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhebolung-img2.jpg?alt=media&token=2f9760ee-0237-4274-98fd-59993d6cefda",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhebolung-img3.jpg?alt=media&token=f56c17a5-36f6-4e7d-a06d-6126c85c9259",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhebolung-img3.jpg?alt=media&token=f56c17a5-36f6-4e7d-a06d-6126c85c9259",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhebolung-img5.jpg?alt=media&token=11db5011-2d64-488c-b92e-cac2357be0d0"
    },
    {
        "title": "Binirayan Festivals",
        "islandGroup": "visayas",
        "date": "April 10",
        "dateFormat": "2022-04-10",
        "location": "Antique",
        "paragraph1": "Binirayan Festival is a popular entry on the Philippines’ social calendar of events. It is a month-long festival that begins in early December, so you have plenty of time to visit and enjoy the festivities! The festival is celebrated in Antique Province as a way to commemorate the arrival of the ten Bornean Datus in Hamtic town way back in the mid-19th century Borneo region. The fascinating thing about Binirayan is that contrary to popular belief, this event is held to honor the Malay roots of locals in Antique. The festival has been held almost every year since 1974. And since 2011, it has consistently been held in the month of December – before that, the actual month of the festival switched back and forth between April and December every few years. Binirayan literally translates to ‘where they sailed to’. As in where the Borean Datus sailed to when they came to the island of Panay. And so, it makes perfect sense that the festival is opened with a parade from Pantalan port to Malandog Beach – the area where it is believed to have been the docking point for their ancestors.",
        "paragraph2": "The running theme of the Binirayan festival is ‘Retracing Roots, Celebrating Culture and Greatness’. It is all about the celebration of their rich history and honoring their ancestors, and in the Philippines, that is more than reason enough for a big celebration. In fact, the Tuna Festival is a really popular event in the country – just imagine how much more important the Binirayan festival is. This means that it calls for a more pompous and grand celebration. Festivals in the Philippines are known for all sorts of events, from sports competitions to film screenings. But the actual events tend to vary from festival to festival, with only a few of them being a staple in the larger celebrations. One of the first things that visitors note at the Binirayan Festival is the coordination of performances. These range from theatrical street plays with the cast adorning full Malayan costumes to rituals performed by those in authority at Binirayan’s location. The flotilla (boat-like floats) are also a remarkable attraction as are the exquisite parades.",
        "img": "./img/fest-gallery/binirayan-img1.jpg",
        "paragraph3": "Beauty competitions are also a very popular event in the bigger celebrations; the most stunning women from the region compete for the title of the most beautiful one, as they attempt to pass various challenges a panel of judges has set for them. A grueling task obviously, considering just how stunning Filipino women are. But, beauty queens will be glad to participate in the Lin-ay Kang Antique, formally Miss Antique. The winners of the title get to be Ambassadors for the different charities in the region. Other areas tested in the beauty pageants include talent shows, a host of interviews as well as fun activities managed by the organizing committee. And no Filipino festival would be complete without a street dancing competition. This is the event that’s hardest not to participate in – there’s something about hearing the drum music and seeing all those people rhythmically moving along, which just causes your hips to develop a mind of their own and start swaying to the music. Of course, anyone can join in the dance, but only the established groups of dancers can take home the prizes.",
        "paragraph4": "Exhibits of local arts, crafts, and products are also a big part of the Binirayan festival. Not only are they a great opportunity for the local artists to gain some exposure and earn extra cash, but they’re also an excellent way for the tourists to get to know the culture of the region better. And arts and crafts made by the locals make much better and more personal souvenirs to take back home. To enjoy these works of art and so much more, look out for the itinerary prior to the big day. Typically, Binirayan Festival is an exciting location to spend part of one’s holiday in the Philippines, so do check it out. Since 2007, the Binirayan Confab has been a regular part of the festival. It’s different from all the other events and festivities, in it that this is a gathering of scholars, artists, academics, and nearly everyone who is interested in ‘Antiqueniana’. The purpose of the Binirayan Confab is to discuss and consider the future of the region, in addition to honoring and celebrating its past.",
        "imgItem1": "./img/fest-gallery/binirayan-img2.jpg",
        "imgItem2": "./img/fest-gallery/binirayan-img3.jpg",
        "imgItem3": "./img/fest-gallery/binirayan-img4.png",
        "imgItem4": "./img/fest-gallery/binirayan-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/-CrUNlOmsVc",
        "ref": "https://expertworldtravel.com/philippines/binirayan-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbinirayan-img1.jpg?alt=media&token=a83ba189-5e21-4512-b775-f795641bb130",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbinirayan-img2.jpg?alt=media&token=27c7e587-3e3b-400a-93f9-fb11e7575c2c",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbinirayan-img3.jpg?alt=media&token=2e70bdc3-e33d-42e2-8097-d36f00c3b24c",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbinirayan-img4.png?alt=media&token=ad5ad21a-1963-4e63-a4bd-d237140b0d6b",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbinirayan-img5.jpg?alt=media&token=054b740e-fed3-4425-9338-39472303a778"
    },
    {
        "title": "Rodeo Masbateño Festival",
        "islandGroup": "visayas",
        "date": "April 1",
        "dateFormat": "2022-04-01",
        "location": "Masbate",
        "paragraph1": "The Rodeo Masbateño Festival is an annual event which takes place in Masbate City that showcases skills in livestock handling, such as lassoing, wrestling, and riding cattle. Also included in the event are a fair and exhibitions and trade of cattle and horses. The event has taken place every summer since 1993 in the province of Masbate, which is traditionally considered the “Cattle Country of the Philippines.” The festival opens with a lively parade of horseback riders. There are also livestock shows, a carnival, and a trade fair featuring local products, as well as animal health seminars.",
        "paragraph2": "The highlight of the event is the rodeo competition itself. Men and women dress up in cowboy outfits to perform stunts like lassoing on foot and on horseback, livestock wrestling, casting down, load carrying, bull riding and whipping, the two-person carambola, and other activities related to the handling of livestock. These events draw people from the rest of the Philippines and around the world as well as locals. International cowboys and bull riders also participate in the competitions.",
        "img": "./img/fest-gallery/rodeo-img1.jpg",
        "paragraph3": "The Rodeo Masbateño Festival was conceived in 1992 as a way of uplifting the local cattle industry. It was started by MAKUSOG, a group of ranchers and businesspeople of Masbate, who formed the Rodeo Masbateño Foundation. There had been a long tradition of cattle raising in the province, with some 81% of its land used for pasturing livestock, but at that point in time the industry was in a slump. With the support of the provincial governor Emilio Espinosa Jr., the first Rodeo was staged in 1993. Following this, it became an annual event that improved tourism as well as commerce in the region and increased the locals’ pride in their province’s unique identity and products. The event was initially known as Rodeo Filipino, but the name was eventually changed to Rodeo Masbateño. It grew into a national event over the years, attracting tourists from all over the Philippines and abroad.",
        "paragraph4": "In recognition of the success of this event, on September 2, 2002, President Gloria Macapagal-Arroyo issued Executive Order No. 120 declaring Masbate as the Rodeo Capital of the Philippines. Masbate has also become known as the Rodeo Capital of Asia and is now affiliated with the Professional Rodeo Cowboys Association of America. Its homegrown cowboys, whose rodeo talents have been honed at the festival, have participated in the National Rodeo Finals in Las Vegas.",
        "imgItem1": "./img/fest-gallery/rodeo-img2.jpg",
        "imgItem2": "./img/fest-gallery/rodeo-img3.jpg",
        "imgItem3": "./img/fest-gallery/rodeo-img4.jpg",
        "imgItem4": "./img/fest-gallery/rodeo-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/IsyQDFgP2tI",
        "ref": "https://www.vigattintourism.com/tourism/articles/Rodeo-Masbateo-Festival",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Frodeo-img1.jpg?alt=media&token=312bf333-24c0-41d3-bffd-61c7e60ebaa5",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Frodeo-img2.jpg?alt=media&token=c3898856-c534-493e-b74d-7bf4a7caf320",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Frodeo-img3.jpg?alt=media&token=2777243c-9677-4a1a-b304-fed5a4e2f541",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Frodeo-img4.jpg?alt=media&token=7efea792-26e4-4ccc-a5c5-845170484ab2",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Frodeo-img5.jpg?alt=media&token=3979c319-e342-457e-bbf7-ae61dd1f393d"
    },
    {
        "title": "Sarok Festival",
        "islandGroup": "visayas",
        "date": "February 14th",
        "dateFormat": "2022-02-14",
        "location": "Consolacion, Cebu",
        "paragraph1": "Consolacion, Cebu celebrates the “Adlaw sa Consolacion” or the Sarok Festival every February 14th. The festival is participated by different barangays, elementary and high school students. They will be portraying and showcasing how “SAROK” gave life to the community especially to the farmers of Consolacion. Sarok is a kind of hat that is made from bamboo strips and dried banana leaves. This is commonly used by farmers of Consolacion for protection against the rain and the heat of the sun.",
        "paragraph2": "Pasigarbo sa Sugbo will not be  possible without having the Sarok festival participating.  Sarok festival is a mardigras of colorful props and costumes and street dancing along the main road of Consolacion , this event is celebrated every 28th of October. The significance of the dance is to elucidate the importance of sarok in the history of Consolacion.  Sarok is a hat made of bamboo and dried banana leaves, this material is used by farmers and natives (Consolacionanon) to protect themselves from the sunlight and the rain.",
        "img": "./img/fest-gallery/sarok-img1.jpg",
        "paragraph3": "The Sarok Festival celebrates the foundation of the town of Consolacion. It is the main highlight of the celebration and features a street dancing competition among primary and secondary schools of the municipality. The Sarok Festival was first celebrated in 1996 and was initially scheduled to be held on February 14. But this was changed after a resolution was passed to make it coincide with the “Adlaw sa Consolacion” celebration or the foundation day of the town.",
        "paragraph4": "The Miligoy de Cebu, a published Filipino folk dance from the area, served as the inspiration of the musical concept for the Sarok Festival. Attractive costumes are worn by the participants with the sarok as the main prop for their presentation. Aside from celebrating the foundation day of the town, the Sarok Festival also encourages the preservation of the history and culture of the town",
        "imgItem1": "./img/fest-gallery/sarok-img2.jpg",
        "imgItem2": "./img/fest-gallery/sarok-img3.jpg",
        "imgItem3": "./img/fest-gallery/sarok-img4.jpg",
        "imgItem4": "./img/fest-gallery/sarok-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/arflRz8egOI",
        "ref": "http://www.traveltothephilippines.info/2017/07/30/sarok-festival-is-a-celebration-of-bamboo-hats/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsarok-img1.jpg?alt=media&token=f9dfc61d-4e66-4f36-a9ec-f7cf36c0e305",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsarok-img2.jpg?alt=media&token=63d1a119-98df-4d67-84a9-7bacd3bd9d5d",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsarok-img3.jpg?alt=media&token=c219dd68-e871-4994-8664-fc702f486da2",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsarok-img4.jpg?alt=media&token=9997d825-38df-40ca-858e-4381ad567c2c",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsarok-img5.jpg?alt=media&token=7b19ac64-b0ec-460e-96f8-c7d7dd11ea1a"
    },
    {
        "title": "Haladaya Festival",
        "islandGroup": "visayas",
        "date": "April 17",
        "dateFormat": "2022-04-17",
        "location": "Daanbantayan, Cebu",
        "paragraph1": "Haladaya Festival is honor to the patron saint of Daanbantayan, St. Rose of Lima. Before in 1834, Daanbantayan was so-called “Kandaya” a name from the leader of first malayan settlers, si “Datu Daya”. This is why people of Daanbantayan will celebrate the Haldaya Festival because from the word of “Haladaya” which means “Halad Kang Datu Daya!” They will offer a dance and thanksgiving of Datu Daya for defending the town from harassment and attacks from the Moro pirates and making the Daanbantayan Cebu a progressive town. Expect the unexpected!! One of the big highlights in the festival are the Haladaya Festival Queen, Street dancing competition and the grand parade called Haladaya.",
        "paragraph2": "Aside from celebrating the feast day of the patron saint of a town, festivals in the towns of Cebu also pay homage to a significant event or leader of the community in the past. One of these festivals that honor a revered leader is the Haladaya Festival of Daanbantayan. The Haladaya Festival of Daanbantayan not only celebrates the feast day of St. Rose de Lima, it also pays homage to Datu Daya. In fact, the name Haladaya means “Halad kang Datu Daya.” Datu Daya is a legendary chieftain who was the leader of the first Malaysian settlers in Cebu. He was the ruler of Kandaya, which was the old name of Daanbantayan. Datu Daya was idolized by the settlers due to his leadership and bravery in protecting the community from marauding pirates who constantly attacked the community.",
        "img": "./img/fest-gallery/haladaya-img1.jpg",
        "paragraph3": "The Municipality of Daanbantayan, Cebu which is located the northern most part of Cebu celebrates its annual Haladaya Festival every 30th of August in time of the feast of its patron saint, St. Rose of Lima. From the words “Halad kang Datu Daya”, the leader of the first Malayan settlers in Daanbantayan. The highlights of the festival are the search for Festival Queen and a talent competition, street dancing competition or grand parade and the ritual showdown called “Haladaya.” It is a dance where people of Daanbantayan show the heroism of Datu Daya and a celebration of victory, life and good harvest.",
        "paragraph4": "Hadalaya Festival stages spectacular performance of competing contingents from public elementary and secondary schools students in their colorful ethnic inspired costumes as they show the intricate steps of the dance as they move along, chanting on the street with the clicking, rolling and the thunderous beat of the drums.",
        "imgItem1": "./img/fest-gallery/haladaya-img2.jpg",
        "imgItem2": "./img/fest-gallery/haladaya-img3.jpg",
        "imgItem3": "./img/fest-gallery/haladaya-img4.jpg",
        "imgItem4": "./img/fest-gallery/haladaya-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/zPYZWEMZsD4",
        "ref": "http://www.traveltothephilippines.info/tag/haladaya-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhaladaya-img1.jpg?alt=media&token=1bc6c519-faaf-4c35-90ac-8350c8cb043b",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhaladaya-img2.jpg?alt=media&token=d0e9b613-9ecb-4c31-ac6d-e045f50d7cff",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhaladaya-img3.jpg?alt=media&token=28761b1c-53ab-4fec-af68-1d3d8f8ab98b",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhaladaya-img4.jpg?alt=media&token=71ad2e08-fdea-4ed4-ac72-9f30a56ae02b",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fhaladaya-img5.jpg?alt=media&token=6ff69761-0133-4adb-9fd6-a4cb17d7e0f3"
    },
    {
        "title": "Tartanilla Festival",
        "islandGroup": "visayas",
        "date": "June 12",
        "dateFormat": "2022-06-12",
        "location": "Cebu",
        "paragraph1": "People in Cebu love to celebrate festivals or are fiesta-loving people. Cebu has one of the most colorful and world-renowned festivals in the Philippines and they celebrate it with excitement and high spirits. Cebu celebrates different festivals in different towns and cities. Cebu celebrate fiestas with religious rituals and dancing in the streets to the beat of the drums.",
        "paragraph2": "The Tartanilla Festival hels every 12th of June is Cebu City’s way of preserving the tartanilla (horse-drawn carriage) heritage by reviving the oldest mode of transportation to ply some of the city’s streets. The festival coincides with the city’s celebration of the country’s Independence Day starting from June 1 to 12. gaily decorated tartanillas driven by kutseros ply the streets of some of the city’s barangays and compete for several awards.",
        "img": "./img/fest-gallery/tartanilla-img1.jpg",
        "paragraph3": "Tartanilla Festival is held in Cebu City and is a horse- drawn carriage heritage by reviving the oldest mode of transportation so called calesa which they used for travelling around the city’s streets. The highlights of this festival include the parade tartanillas, a horse racing competition, tartanilla decoration competition, a bazaar and flea market. The Tartanilla is a festival that reflects the Filipino culture and its love for history. The said festival is one manner of preserving this prestige-rich history and culture of Cebu. Dubbed as antique mode of transportation, tartanillas are still roaming around the streets of the Queen City. On the event you will have a tasteful shot of seeing the beautifully decorated tartanillas driven by awesome kutseros.",
        "paragraph4": "By remembering their culture and history and celebrating them, it tells a lot about the passion that the Filipinos have in store of. Such an event that coincides with the momentous Independence Day will be celebrated in a glorious fashion, one that should not be missed. But having the golden chance of riding these tartanillas is a memorable and meaningful experience. Don’t try to miss them as they are transportations too of happiness, glee and honor. Hiya!",
        "imgItem1": "./img/fest-gallery/tartanilla-img2.jpg",
        "imgItem2": "./img/fest-gallery/tartanilla-img3.jpg",
        "imgItem3": "./img/fest-gallery/tartanilla-img4.jpg",
        "imgItem4": "./img/fest-gallery/tartanilla-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/_ASgFobrVtg",
        "ref": "https://pinasbests.com/cebu-festivals-that-you-should-visit/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftartanilla-img1.jpg?alt=media&token=215ae61c-ecde-41cb-abe4-c64ce3597daf",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftartanilla-img2.jpg?alt=media&token=33bf7410-e987-4bdf-86d7-5f442c34e361",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftartanilla-img3.jpg?alt=media&token=b2fa7ff8-8cd9-4972-bfd2-bddd9e592f03",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftartanilla-img4.jpg?alt=media&token=89c6445a-844d-49bb-a155-bb00ee883fe0",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftartanilla-img5.jpg?alt=media&token=efdb0671-b073-4a55-8c91-ea6af080919c"
    },
    {
        "title": "Soli-Soli Festival",
        "islandGroup": "visayas",
        "date": "March 18",
        "dateFormat": "2022-03-18",
        "location": "San Francisco, Camotes Island",
        "paragraph1": "Soli-Soli Festival in San Francisco on Camotes Islands is one of the grandest festivals being held annually in the province. It is a thanksgiving celebration among locals living around Lake Danao where the Soli-Soli grass abounds – a material being used as one of the sources of livelihood. This festival coincides with the town ‘fiesta’ celebrating St Joseph the Carpenter as their patron saint on March (3rd Sunday). If you don’t know yet, every town in the country has a patron saint watching over its inhabitants!",
        "paragraph2": "Soli-Soli Festival is, for one, features a vibrant and lavish celebration by active participants sporting colorful costumes and perform choreographed dance routines. Basically, you will enjoy the day with dancing competitions, display of local products and various sorts of merrymaking. The festival aims to promote the town and the whole island itself to further entice visitors to travel and explore the island’s beaches and other resources.",
        "img": "./img/fest-gallery/soli-img1.jpg",
        "paragraph3": "Soli-Soli Festival is fundamentally associated with the dance competitions that are joined by various contingents from the local schools. It is the dance steps and choreography that makes the festival unique and interesting to watch. You will certainly enjoy this one day super celebration on this part of the island.",
        "paragraph4": "Soli-Soli Dance Competition is the major attraction of the day and the costly one. The contingents or participants are being supported by the local government for their costumes, props and other expenses. Most of the participant dancers are from elementary and high schools in town. They are locally trained by mostly local choreographers, unlike the festivals in other towns that hire choreographers from Cebu City. In some towns, there is a free category wherein contingents from other towns or older groups may join in their festival competition, aside from local elementary and high school participants. In San Francisco’s festival, the contingents can win various prizes from three categories, namely: dancing street performance, showdown competition, and best in costume and best in audio van.",
        "imgItem1": "./img/fest-gallery/soli-img2.jpg",
        "imgItem2": "./img/fest-gallery/soli-img3.jpg",
        "imgItem3": "./img/fest-gallery/soli-img4.jpg",
        "imgItem4": "./img/fest-gallery/soli-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/ns8AxGJKevU",
        "ref": "https://www.travelingcebu.com/soli-soli-festival.html#:~:text=Soli%2DSoli%20Festival%20in%20San%20Francisco%20on%20Camotes%20Islands%20is,of%20the%20sources%20of%20livelihood.",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsoli-img1.jpg?alt=media&token=bb6606e6-359d-4313-8d85-4edb7dc56ea4",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsoli-img2.jpg?alt=media&token=3c3a5aef-07ea-40ff-aab6-e3ab84872b37",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsoli-img3.jpg?alt=media&token=fa324e16-4fe5-49f0-bf0b-c4d2b5139a3f",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsoli-img4.jpg?alt=media&token=d6227455-21e4-45cb-9d15-b7e24f8dae5d",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsoli-img5.jpg?alt=media&token=f3fefb17-c74e-4c15-827c-95f677fc85ef"
    },
    {
        "title": "Kadaugan sa Mactan Festival",
        "islandGroup": "visayas",
        "date": "April 22-27",
        "dateFormat": "2022-04-22",
        "location": "Lapu-lapu City",
        "paragraph1": "Kadaugan sa Mactan (or the Victory in Mactan) is a celebration reenacting the victory of Mactan people (Oponganons) during the famous “Battle of Mactan” in the 16th century. This major attraction among local and foreign spectators is being organized by the local government of Mactan Island. The re-enaction of the event is the main event of this celebration which is played by famous local actors or other personalities. The organizers does not only use this celebration to boost the place for tourism but also encourage the locals to rethink about the message of victory and the challenges of time, especially in terms of facing issues of livelihood and leadership in the area and the country as a whole. The bloody Battle of Mactan took place in April 27, 1521 when the iron-clad soldiers of Ferdinand Magellan reach the shores of the island but was fiercely confronted by Chief Lapu-Lapu and his fighters. During the confrontation, the Portuguese explorer lost the battle and met his fate together with most of his soldiers.",
        "paragraph2": "Most historians have agreed that the event actually took place and there is no doubt that it happened. Since in 1981, this re-enactment of the event is being performed annually on the same day – April 27 – as recorded in history books. Actors (and actress) play the main roles of Lapu Lapu and Reyna Bulakna, the wife of the chieftain and Ferdinand Magellan. In the earlier re-enactment Kadaugan sa Mactan, it was commonly called ‘Bahugbahug sa Mactan (or Melee at Mactan) in local language. It was thought that there were 3 ships of Magellan moving up towards the beach of Mactan. That’s where Lapu Lapu and his fighters fiercely fought against them resisting their coming. It is right on that beach that this famous “Battle of Mactan” occurred and recorded in history books.",
        "img": "./img/fest-gallery/kaudagan-img1.jpg",
        "paragraph3": "The re-enactment of the bloody event is usually started from the planting of Magellan’s Cross up to the victory of Lapu Lapu on the island. The battle in the re-enactment commences when there’s high tide and as early as 8 in the morning. That’s because it was believed, and logically so, that Ferdinand Magellan's fleet reached the shore during this time of day. Local talents are usually being employed to play the roles of the important figures in the event. The most important roles are those for Lapu Lapu, Reyna Bulakna (Lapu Lapu’s wife) and Magellan.",
        "paragraph4": "Most often, professional domestic and local actors play those roles. However, some popular figures are also casted to play them. In 2008 Manny Pacquiao (boxer) took the role of Lapu Lapu, Jinkee (Pacquiao’s wife) took Reyna Bulakna’s role, among other roles. As the years go by, Kadaugan sa Mactan or Bahug-bahug sa Mactan has grown and become a fully-blown and interesting celebration. It attracts both local and foreign visitors due to its various and colorful aspects. Just recently, the local officials organized the establishments and other participants to install food stalls to showcase the best cuisines and local food products right at Mactan Shrine where the event took place in the 16th century.",
        "imgItem1": "./img/fest-gallery/kaudagan-img2.jpg",
        "imgItem2": "./img/fest-gallery/kaudagan-img3.jpg",
        "imgItem3": "./img/fest-gallery/kaudagan-img4.jpg",
        "imgItem4": "./img/fest-gallery/kaudagan-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/FKys-q5PSTg",
        "ref": "https://www.travelingcebu.com/kadaugan-sa-mactan.html",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkaudagan-img1.jpg?alt=media&token=b889a0ba-1acf-4294-a5b0-57e9efe8fe66",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkaudagan-img2.jpg?alt=media&token=5691599e-34ac-422b-b62a-33e86b9895ec",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkaudagan-img3.jpg?alt=media&token=ba56ad41-aefc-4dc8-a703-d73b42c3f846",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkaudagan-img4.jpg?alt=media&token=2dba2ef8-4db8-4a02-8e7e-81c6f2ca93cf",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkaudagan-img5.jpg?alt=media&token=97f3df52-283e-49cd-8b5a-c0e49d4c21c4"
    },
    {
        "title": "Tagbo Festival",
        "islandGroup": "visayas",
        "date": "January 19",
        "dateFormat": "2022-01-19",
        "location": "Poro, Camotes Island",
        "paragraph1": "One of the festivals celebrated in the Camotes Islands is the Tagbo Festival. The festival is celebrated in the month of January and is held in honor of the patron of the town of Poro, the Santo Niño. While the Sinulog may be considered as the grandest festival honoring the Santo Niño, the Tagbo Festival of Poro in Camotes is equally colorful albeit on a smaller scale.",
        "paragraph2": "The Tagbo Festival in Poro also commemorates the foundation of the town. The term “tagbo” is a Visayan word that means “to meet or to converge.” It celebrates the time when Poro was recognized as the first town on the island of Poro in 1780. The story behind the “tagbo” revolves around the meeting of two tribes, the farmers who came from sitio Tag-anito and the fishermen from sitio Mactang. Sitio Tag-anito is now the town of Tudela while sitio Mactang is now one of the barangays of Poro, Barangay Esperanza.",
        "img": "./img/fest-gallery/tagbo-img1.jpg",
        "paragraph3": "Tagbo Festival is celebrated every January in honor of patron Sto. Niño de Poro. Beloved memoir of a living past, Tagbo is the cornerstone from which this great municipality has sprung. Rich in cultural heritage and deep in spiritual values, Tagbo is a very significant event precluding the birth of a town very dear to the hearts of her sons and daughters.",
        "paragraph4": "",
        "imgItem1": "./img/fest-gallery/tagbo-img2.jpg",
        "imgItem2": "./img/fest-gallery/tagbo-img3.jpg",
        "imgItem3": "./img/fest-gallery/tagbo-img4.jpg",
        "imgItem4": "./img/fest-gallery/tagbo-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/b7-j2kHWN24",
        "ref": "http://www.traveltothephilippines.info/tag/tagbo-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftagbo-img1.jpg?alt=media&token=6aee96a9-8c32-4688-b41f-3c3116c7e4cf",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftagbo-img2.jpg?alt=media&token=44797d95-5335-415d-adef-da03db39052e",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftagbo-img3.jpg?alt=media&token=38d22869-9f7e-40a3-8a8b-d8a59ca475f7",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftagbo-img4.jpg?alt=media&token=17e9a658-7379-4724-a166-d6fd704f7cab",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Ftagbo-img5.jpg?alt=media&token=3d991794-8606-4e71-8559-3171abbc18f1"
    },
    {
        "title": "Kalilangan Festival",
        "islandGroup": "mindanao",
        "date": "February 27",
        "dateFormat": "2022-02-27",
        "location": "General Santos City",
        "paragraph1": "Each year, General Santos City marks its foundation anniversary on February 27 with various activities culminating the weeklong celebration of Kalilangan Festival. The anniversary celebration commemorates the landing of the city's founder, General Paulino Santos, along with the first settlers from Luzon, at the shores of Sarangani Bay.",
        "paragraph2": "Kalilangan is derived from the rootword “Kalilang” which typically means celebration or commemoration in the Maguindanaon dialect. kalilang projects a positive and dynamic meaning for it engulfs the artistic, humane and altruistic aspects of social interaction that takes place in any occasion or celebration. Kalilangan means festival, feastivity or jubilee. It is a social gathering marked by exchanging of amenities among traditional leaders, elders, allies and subordinates in varying tones. Kalilangan is a noble tradition.",
        "img": "./img/fest-gallery/kalilangan-img1.jpg",
        "paragraph3": "It is a compleat work of art nourished and nurtured a rich cultural heritage that has withstand the test of time from generation to generation.",
        "paragraph4": "The main uniqueness of Kalilangan is that, it is not religious in nature, unlike most festivals of the country. But rather, it is a festival of unity, of Gensan’s culture, of Gensan’s way of life. During the advent of festivals, when DOT’s campaign promoted the Philippines as Fiesta Islands, the Generals now thought of conceptualizing a festival that will be uniquely Gensan. “Name the festival” contest was widely disseminated and BaiJanena A. Tito, PhD, entry won the competition.",
        "imgItem1": "./img/fest-gallery/kalilangan-img2.jpg",
        "imgItem2": "./img/fest-gallery/kalilangan-img3.jpg",
        "imgItem3": "./img/fest-gallery/kalilangan-img4.JPG",
        "imgItem4": "./img/fest-gallery/kalilangan-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/mdvJlE_SW5w",
        "ref": "https://www.gensancemcdo.org/tourism-division/festivals-events-section/kalilangan-festival/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkalilangan-img1.jpg?alt=media&token=a3111b0b-511a-44de-bd04-64ee0f02cb88",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkalilangan-img2.jpg?alt=media&token=f6460ac3-82b8-414d-b84b-0dbf229c00b8",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkalilangan-img3.jpg?alt=media&token=ab63af34-4665-4cbc-be47-5355ae18e9b1",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkalilangan-img4.JPG?alt=media&token=be0ab883-302c-44a7-87ca-913ccf46c0cc",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkalilangan-img5.jpg?alt=media&token=ae0944f1-d5c4-426d-ae4f-8b04d7fdc5dd"
    },
    {
        "title": "Sibug-Sibug Festival",
        "islandGroup": "mindanao",
        "date": "February 26",
        "dateFormat": "2022-02-26",
        "location": "Ipil, Zamboanga Sibugay",
        "paragraph1": "The foundation of Sibugay is celebrated to promote the province's primary produce which is the oyster or talaba. The highlight of the feast is the “Talaba Longest Grill”. It is also famous because of the juiciest, meatiest, and most delicious taste of Sibugay oysters. The place recently achieved a world record for the World’s Longest Talaba Grill, with 5- to 12-inch-long oysters or talaba as the main feature. For that reason, the province of Zamboanga Sibugay has become the Talaba Capital of the Philippines.",
        "paragraph2": "The Sibug-Sibug Festival is the annual two-week celebration in the municipality of Ipil, Zamboanga Sibugay. This event is one of the most awaited festivals. The locals celebrate this event to commemorate the founding of the province and to give thanks to their patron.",
        "img": "./img/fest-gallery/sibug-img1.jpg",
        "paragraph3": "The production of oyster is said to be one of the main sources of economic development in the province. Many people are depending on the oyster business. Meanwhile, the rubber trade is said to be the second source of income generation. Zamboanga Sibugay has been renowned for having the oldest rubber cultivated area in the Philippines. Sibugay is a place where you can find the largest and meatiest oysters in the country.",
        "paragraph4": "The province is the main supplier of the oysters inside and outside the country, especially in the Asia Pacific region. There are well-known oyster farms that are located in the municipalities of Kabasalan, Siay, and Alicia.",
        "imgItem1": "./img/fest-gallery/sibug-img2.jpg",
        "imgItem2": "./img/fest-gallery/sibug-img3.jpg",
        "imgItem3": "./img/fest-gallery/sibug-img4.jpg",
        "imgItem4": "./img/fest-gallery/sibug-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/prrzUKLPtwE",
        "ref": "https://www.vigattintourism.com/index.php?/tourism/articles/Sibug-Sibug-Festival-Most-Awaited-Festival-of-Zamboanga-Sibugay",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsibug-img1.jpg?alt=media&token=57a22ab7-945f-420f-ad8a-3b2195625886",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsibug-img2.jpg?alt=media&token=ff347b60-cf2c-4861-b769-0b2472471a29",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsibug-img3.jpg?alt=media&token=9af37683-6b5c-4062-bbfa-b11eba0de05e",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsibug-img4.jpg?alt=media&token=104a1488-1235-48fe-b93c-37d093af00cf",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fsibug-img5.jpg?alt=media&token=48e11120-8daa-4815-9344-e501d692d9c4"
    },
    {
        "title": "Lanzones Festival",
        "islandGroup": "mindanao",
        "date": "October 18",
        "dateFormat": "2022-10-18",
        "location": "Mambajao, Camiguin",
        "paragraph1": "Lanzones Festival is an annual celebration in October. It is weekend of fun including street dancing, numerous beauty pageants and a parade celebrated in Mambajao town. The lanzones fruit ripens sometime during the third week of October.",
        "paragraph2": "Camiguin Lanzones Festival which commemorates the annual harvesting of lanzones in this island province of the Philippines located in Bohol Sea just off the northern coast of Mindanao. The Camiguin Lanzones Festival is also the time when agri-cottage industry products, town beautification, the local culture and some indigenous sports are showcased and form part of the splendid parade of lanzones.",
        "img": "./img/fest-gallery/lanzones-img1.jpg",
        "paragraph3": "The Lanzones Festival is one of Mindanao's longest-running festivals celebrating the island's main export of sweet lanzones. Due to the abundant fruit harvests, visitors come from all over the country and different parts of the world to witness one of the most exciting festivals.  Thousands of tourists and locals watch on as the students dance to the beat, while the fairies guard the lanzones.",
        "paragraph4": "",
        "imgItem1": "./img/fest-gallery/lanzones-img2.jpg",
        "imgItem2": "./img/fest-gallery/lanzones-img3.jpg",
        "imgItem3": "./img/fest-gallery/lanzones-img4.jpg",
        "imgItem4": "./img/fest-gallery/lanzones-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/HDUcgzYfjFM",
        "ref": "https://www.gowherewhen.com/event/lanzones-festival",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Flanzones-img1.jpg?alt=media&token=0174ce8d-53ee-4fdc-8f23-3f802ba6077a",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Flanzones-img2.jpg?alt=media&token=a4aa47fd-709f-4dbc-9176-f5d017b4910e",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Flanzones-img3.jpg?alt=media&token=ede79d7b-8c27-4fc0-a83a-839a976112ed",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Flanzones-img4.jpg?alt=media&token=9d8d18c3-9703-4bc5-b376-69be98ee97c5",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Flanzones-img5.jpg?alt=media&token=ec85701f-ffd7-4f85-b4c8-b7b07a560c35"
    },
    {
        "title": "Inaul Festival",
        "islandGroup": "mindanao",
        "date": "February 12",
        "dateFormat": "2022-02-12",
        "location": "Buluan, Maguindanao",
        "paragraph1": "The Inaul Festival in Buluan, Maguindanao is still on its second year. This colorful and vibrant festival is observed annually on February 8 to 14. But this festival is actually under a new name or a continuation of what used to be called the Sagayan Festival. The latter was already celebrated in Misamis Oriental.",
        "paragraph2": "The “inaul” is an original Maguindanaon product, a hand-woven cloth. The word inaul literally means “weaved” in English. This distinct Filipino product deserves further national attention, and this is the primary purpose of this festival. This festival is also sending a message that Maguindanao is relatively a safe and tourist-friendly place. I say it because I was there, I personally went there to experience the Inaul Festival. The festival is similar to the other festivals in the country, where there are products showcase, food feast, float competition, concerts and, of course the beauty pageant.",
        "img": "./img/fest-gallery/inaul-img1.jpg",
        "paragraph3": "The earliest Inaul weavers were believed to have come to Maguindanao with Shariff Mohammed Kabungsuwan, who introduced Islam to the area. This place is now known as Sultan Kudarat municipality in the province. The Inaul tradition was passed on across generations, with weavers learning from their mothers, who in turn learned from their own mothers. Older and master weavers now also teach young and old alike who are willing to learn.",
        "paragraph4": "Maguindanao is surely isn’t shy about its love for celebration. A brainchild of Governor Toto Mangudadatu, Inaul Festival aims to honor their culture & to keep it all alive. It also hopes to bring their unique fiber arts to the country’s sparkling festival arena. If only you made it to Inaul Festival, you’d experience what Maguindanao, MagandaNOW really means beyond what goes on national headlines.",
        "imgItem1": "./img/fest-gallery/inaul-img2.jpg",
        "imgItem2": "./img/fest-gallery/inaul-img3.jpg",
        "imgItem3": "./img/fest-gallery/inaul-img4.JPG",
        "imgItem4": "./img/fest-gallery/inaul-img5.JPG",
        "ytPath": "https://www.youtube.com/embed/bs-UjSBfTJk",
        "ref": "https://pilipinas.org/inaul-festival-in-maguindanao/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Finaul-img1.jpg?alt=media&token=6c532f60-a3c6-4c78-8bb1-6203fb5992bd",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Finaul-img2.jpg?alt=media&token=037923fb-66e5-4d20-9055-adcb22b90f61",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Finaul-img3.jpg?alt=media&token=09152c43-c171-4012-b4c6-57d038403889",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Finaul-img4.JPG?alt=media&token=87942fc5-e56a-4b74-a6ec-bf2e44746808",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Finaul-img5.JPG?alt=media&token=d086ad82-51b6-4a59-b8d7-84e5493b240c"
    },
    {
        "title": "Kapyaan Festival",
        "islandGroup": "mindanao",
        "date": "February 18-20",
        "dateFormat": "2022-02-18",
        "location": "Jose Abad Santos, Davao Occidental",
        "paragraph1": "Kap’yaan Festival is a festival of the Day of Establishment of the town of Jose Abad Santos in the area of Davao Occidental. The festival held each eighteenth to twentieth of February, establishing Anniversary of the production of the region.",
        "paragraph2": "It is additionally a thanksgiving festivity for the great year and abundant gather of the region's items like pineapple, rice, corn and more. The 2014 Kap'yaan Festival was not just commended on account of the abundance of the region yet additionally the lavishness of its way of life too, authorities said. The Jose Abad Santos district Mayor Jimmy Joyce is investigating every possibility in anticipation of the current week's Kap'yaan Festival, with all the 26 barangays joining to make the yearly celebration a gigantic achievement. The Kap'yaan Festival praises the establishing commemoration of the region with an agri-exchange reasonable, inborn introductions and a city military parade. This year, Mayor Joyce acquired a beguilement appear with a Ferris Wheel and different attractions, the first in the district.",
        "img": "./img/fest-gallery/kapyaan-img1.jpg",
        "paragraph3": "Jose Abad Santos is one of the five municipalities of the country’s 81st and youngest province, Davao Occidental. This first class coastal municipality is the southernmost municipality in mainland Mindanao. The Kapyaan festival they celebrated every year featured several activities.",
        "paragraph4": "The first day was dubbed as IP day and religious night. The opening ceremony was led by their Vice Mayor who was also present in all the activities. The Moto Cross competition was participated in by enthusiasts not just from the municipality but from the nearby provinces as well. An agri-trade fair was organized for the benefit of the micro-enterprises which featured local delicacies and artisan products. The civic parade was participated in by representatives from the 26 baranggays, municipal offices, representatives from National Government Agencies and other socio-civic groups.",
        "imgItem1": "./img/fest-gallery/kapyaan-img2.jpg",
        "imgItem2": "./img/fest-gallery/kapyaan-img3.jpg",
        "imgItem3": "./img/fest-gallery/kapyaan-img4.jfif",
        "imgItem4": "./img/fest-gallery/kapyaan-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/9Tnz_nV7zLk",
        "ref": "https://www.hellotravel.com/events/kapyaan-festival",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkapyaan-img1.jpg?alt=media&token=efb0672b-7475-422e-9797-25994a7cf67a",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkapyaan-img2.jpg?alt=media&token=85b7cfc6-8b1d-43d4-8759-d0fc17a4258d",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkapyaan-img3.jpg?alt=media&token=cd09fbbc-9afe-4308-8964-a0c77d57af58",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkapyaan-img4.jfif?alt=media&token=6e05fd37-6a4a-40ca-a3a7-3c6d1d6754c5",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fkapyaan-img5.jpg?alt=media&token=b37c8f60-2d3b-48b0-b365-6c9b38b90a06"
    },
    {
        "title": "Balangay Festival",
        "islandGroup": "mindanao",
        "date": "May 19",
        "dateFormat": "2022-05-19",
        "location": "Butuan City",
        "paragraph1": "Each year, on May 19, a fiesta celebration reverberates across Butuan City in honor of its patron Saint Joseph. Along with this, the Balanghai Festival is celebrated, highlighting activities and events celebrating the city’s rich history, culture and traditions.",
        "paragraph2": "This celebration is highlighted with activities both on water and on land, a perfect commemoration for a city known for its historic Balanghai boats. A part of the religious feast is a fluvial procession across one of Mindanao’s mighty river basin, the Agusan River. According to local historians, the fluvial procession is a reminder of the importance of the Agusan River and its historical influence and how it has sculpted its vast landscape and communities stretching from the province of Agusan del Sur towards Agusan del Norte into the mouth of Butuan Bay.",
        "img": "./img/fest-gallery/balangay-img1.jpg",
        "paragraph3": "Butuan’s long history has always been linked with the flow and the floods brought in by the river. The fluvial procession is a thanksgiving, as well as an eye opener for the people to recognize the significance of the Agusan River.",
        "paragraph4": "The people in Butuan City believe that the festival they celebrate is their own way, they hope to promote, protect and raise awareness towards the conservation of the entire river basin which has become fragile over the years because of negligence towards our environment and it’s eco-system.",
        "imgItem1": "./img/fest-gallery/balangay-img2.jpg",
        "imgItem2": "./img/fest-gallery/balangay-img3.jpg",
        "imgItem3": "./img/fest-gallery/balangay-img4.jpg",
        "imgItem4": "./img/fest-gallery/balangay-img5.jpg",
        "ytPath": "https://www.youtube.com/embed/34Ax4w5-TPQ",
        "ref": "https://mindanaogoldstardaily.com/balangay-festivals-fluvial-procession-bannering-calls-for-protection-conservation-of-agusan-river/",
        "webSrc_img": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbalangay-img1.jpg?alt=media&token=7580433c-95f3-4c96-921b-1e6494b73364",
        "webSrc_imgItem1": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbalangay-img2.jpg?alt=media&token=32b790fc-e59d-46f6-83d2-70980c91cd5d",
        "webSrc_imgItem2": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbalangay-img3.jpg?alt=media&token=e1080c67-29ee-46d5-9f90-e11b28412be9",
        "webSrc_imgItem3": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbalangay-img4.jpg?alt=media&token=58da9aed-95a7-4315-bbe3-3026abc345b3",
        "webSrc_imgItem4": "https://firebasestorage.googleapis.com/v0/b/festival-img.appspot.com/o/fest-gallery%2Fbalangay-img5.jpg?alt=media&token=592d7e89-7ae9-42a0-9545-824c95d4a0a2"
    }
]
